[
{"title": "Prospect Park Picnic House", "description": "The Picnic House in Prospect Park is a charming and historic building in the heart of Brooklyn's premier park. With scenic views of the 90-acre Long Meadow, outdoor spaces for ceremonies and cocktails, floor-to-ceiling windows, hardwood floors and a working wood fireplace, it provides a bucolic setting for your perfect day. The Picnic House can be tailored for every taste and budget, and is a blank canvas to create the ideal wedding no matter what the season. \n\nOur working wood fireplace, along with full heat and strong air conditioning, means your wedding will be beautiful - cozy or cool - any time of year in Prospect Park! \n\nThe Prospect Park Picnic House is maintained by Prospect Park Alliance, the non-profit organization that sustains, restores and advances Brooklyn's Backyard, in partnership with the City of New York. The Alliance provides critical staff and resources that keep Prospect Park green and vibrant for the diverse communities that call Brooklyn home. \n\nYour entire venue rental fee goes directly to the Alliance - and back into Prospect Park!", "rating": "4.9", "number": "(718) 965-6961", "location": "95 Prospect Park West, Brooklyn, NY", "photos": ["https://media-api.xogrp.com/images/becb45bf-df7b-4a6f-8295-bce2f7e5c8f2~sc_324.480", "https://media-api.xogrp.com/images/5961b06b-06c2-418a-9d8e-8a2f5f723853~sc_324.232", "https://media-api.xogrp.com/images/eb8ad0fa-df50-48b8-ba53-e98cca36ba93~sc_324.232"]},
{"title": "Papillon Bistro & Bar", "description": "The Papillon Bistro & Bar is a charming wedding venue with the atmosphere of a bustling old-time bistro located in the center of Midtown Manhattan, New York, NY. This venue focuses on creating an authentically New York wedding reception that reflects you, your personality, and your needs.\n\nThe venue can accommodate a variety of celebrations, from intimate elopements with as few as 15 guests to grand wedding celebrations with 300 guests. Papillon Bistro & Bar boasts a number of event spaces, all designed to fit your wedding vision. You will have the choice of spaces such as the Burgundy Room, the Parlor Room, the Balcony Space, and the Main Bar, all spanning the entire second floor. Other unique spaces include the Prohibition Room, with its exclusive private bar and capacity for 40 reception guests. The team also offers semi-private dining for even smaller groups, ensuring you and your guests will always find your place at the Papillon.\n\nThe dedicated events team at the Papillon Bistro & Bar will be on hand to help you through the planning process and support you on your wedding day. They can offer services such as customized venue setups and day-of coordination. Their passionate culinary team understands the importance of food during a wedding reception and will help you build a menu that suits any food requirements you or your guests may have. Comprehensive beverage packages are also available, these are customized to suit your needs and can include spirits, beers, wines, and more. The team at the Papillon Bistro & Bar would be delighted to help you bring your wedding venue dreams to life.", "rating": null, "number": "(212) 754-9006", "location": "22 E 54th St, New York, NY", "photos": ["https://media-api.xogrp.com/images/71b27d2c-e205-4956-a89b-ecb06614a9cf~sc_324.480"]},
{"title": "The Skylark", "description": "The Skylark is a rooftop wedding venue located in New York City. This one-of-a-kind wedding destination offers sweeping views of Midtown Manhattan and showcases iconic landmarks such as The Empire State Building and Times Square. Perched high above the Hudson River, this cocktail lounge exudes style and sophistication for events held throughout the year. The venue’s experienced staff provide attentive service throughout the happy couple’s planning experience and wedding day. \n\nThe Skylark features both indoor and outdoor event spaces, and couples can utilize multiple areas for their event. The Main Lounge is the largest function room and boasts floor-to-ceiling windows that highlight the city views. This space is ideal for summer as well as winter weddings as it provides the outdoor vibe while being enclosed. During the warmer months, the Roof Deck is available as an outdoor space for al fresco cocktail hour.  The Living and Pool Rooms can accommodate wedding parties as they get ready for their big day.\n\nThis venue is suitable for weddings of 80 guests for seated dining or up to 150 with a cocktail-inspired reception. When you book your celebration here, you will have access to a suite where you and your wedding party can get ready for the festivities. The event spaces are equipped with amenities such as a high-quality sound system for your entertainment. You can also customize your own dining experience as catering services are provided by Abigail Kirsch.", "rating": "5", "number": "(212) 257-4578", "location": "200 West 39th Street, New York, NY", "photos": ["https://media-api.xogrp.com/images/0e471641-011d-4c00-b214-937b8f9f51d6~sc_324.480", "https://media-api.xogrp.com/images/db404045-5d80-4eb0-819d-6a03265692e3~sc_324.480", "https://media-api.xogrp.com/images/db7dd2fb-0e1b-4262-95ad-aa5451da7f54~sc_324.232", "https://media-api.xogrp.com/images/1016e43d-1978-4bd9-a434-fdb1ce113f4d~sc_324.232"]},
{"title": "City Vineyard at Pier 26", "description": "Nestled along the captivating Tribeca Riverfront in New York, NY, City Vineyard at Pier 26 offers a unique blend of maritime allure and urban sophistication. The venue, adorned with a grape arbor-shaded wine garden and a roof deck boasting panoramic views of the Hudson Estuary and downtown Manhattan, provides an enchanting backdrop for weddings. The year-round dining room, featuring oak tables, leather seating, and a ceiling crafted from wine barrel staves, seamlessly transitions between indoor and outdoor spaces, making it an ideal setting for celebrations in every season. City Vineyard is not only a captivating wedding destination but also an urban winery committed to sustainability and community engagement.\n\nCity Vineyard's commitment to excellence extends to its culinary offerings, designed to be paired with their world-class wines. Drawing inspiration from Mediterranean traditions, the menu features delectable small plates meant for sharing. Whether celebrating in the Main Venue with a capacity of 200 seated or 550 reception guests or enjoying a more intimate setting on the Rooftop Overlook which overlooks the Hudson River, Jersey City Skyline, Battery Park, & Uptown Manhattan guests can savor the harmonious flavors delivered to their tables. From professional event staff to VIP services, state-of-the-art audiovisual facilities, and a focus on sustainability, City Vineyard at Pier 26 promises an unforgettable celebration immersed in elegance and culinary delight.", "rating": null, "number": "(646) 723-2717", "location": "233 West Street, New York, NY | New York", "photos": ["https://media-api.xogrp.com/images/dcf5c074-9696-481b-aed6-0831cd77436b~sc_324.480", "https://media-api.xogrp.com/images/3aca096e-b73f-4b73-b0a2-e6aa5fca138e~sc_324.480", "https://media-api.xogrp.com/images/3ed1247f-2a13-4960-9b29-8675d97ab520~sc_324.232", "https://media-api.xogrp.com/images/de9a0c55-25e8-43d8-b7ff-636591f1c5de~sc_324.232"]},
{"title": "City Winery New York City", "description": "City Winery New York is a stylish wedding venue located just steps from Chelsea Market and The High Line in New York City. Our new waterfront venue embodies the urban winery feel first pioneered at our flagship City Winery location, with two floors of fully-customizable event space suitable for all kinds of private events. From rehearsal dinners to receptions, City Winery New York can form the backdrop for any celebration.\n\nIn addition to the personalized service and signature rustic-chic feel we’ve delivered for over 10 years, our new venue will offer a multitude of new features, including an expanded restaurant with open kitchen, tasting areas to sample our house-made wine, a wood-fired pizza bar, and a full-service craft coffee & espresso bar. Couples can celebrate with up to 175 guests at our venue, with private and semi-private venue rental packages available.  Floor-to-ceiling glass windows will offer sweeping skyline, river and sunset views, highlighting our prime location on the Hudson River. Our Pier 57 home will be a celebration of everything that makes both New York City and City Winery completely unique.", "rating": "5", "number": "(646) 723-6477", "location": "25 11th Ave (at 15th Street), New York, NY", "photos": ["https://media-api.xogrp.com/images/ee102eed-81d1-49b9-9fd0-aef2f60856e5~sc_324.480", "https://media-api.xogrp.com/images/f95becf6-fd98-4bef-8dc5-384471ec0faa~sc_324.480", "https://media-api.xogrp.com/images/3182a79e-2d8d-4671-bc3a-014b559ccedf~sc_324.232", "https://media-api.xogrp.com/images/fd205037-b752-43fe-8cec-c9088b44aaf9~sc_324.232"]},
{"title": "Cloud 9 Yacht Charters", "description": "Located in New York City, Cloud 9 Yacht Charters is a boat venue that can host weddings and other celebratory events. Offering an expansive view of the New York harbor, this luxury yacht charter presents clients with a one-of-a-kind venue option. In addition to scenic vistas, guests attending an occasion at Cloud 9 Yacht Charters can also enjoy gourmet meals and services from professional, onboard staff.\n\nCloud 9 Yacht Charters can accommodate private dinner parties as well as lavish and large occasions. Tied together with a nautical theme, an event here benefits from custom-designed interiors and climate-controlled facilities. There are a couple choices when selecting Cloud 9 Yacht Charters as a wedding venue. For example, the Cloud Nine IV offers a private bridal suite, complete with a bathroom and vanity. Clients can customize the linen colors at their wedding, and they can avail of champagne and a custom wedding cake. Everything from special lighting to draping options to food stations can be accommodated when planning a boat-based wedding. Here, the sky is the limit and the water is your playground.\n\nCloud 9 Yacht Charters is delighted to offer a casual cruise with both food and beverages. Wedding events can host smaller numbers of guests, ranging from 10 to 75, or larger groups, ranging from 75 to 150. Ceremonies can take place on the yacht, as can cocktail hours paired with receptions. Dedicated to couples and their guests, the boat's crew is second-to-none when it comes to exemplary white-glove attentiveness. With more than 23 years in the industry, Cloud 9 Yacht Charters is sure to leave a lasting impression through seamless service.", "rating": "4.5", "number": "(718) 224-4460", "location": "2430 FDR Drive Service Road, New York, NY", "photos": ["https://media-api.xogrp.com/images/85cc46ce-51b5-4504-8493-1457f890d4f5~sc_324.480", "https://media-api.xogrp.com/images/fa7b4875-85bf-4c7b-8f22-73afcf8f2b83~sc_324.480", "https://media-api.xogrp.com/images/40f06a19-892a-4800-a7f1-b7a1844dff2f~sc_324.232", "https://media-api.xogrp.com/images/1e787c0b-618d-4ab7-a708-d1310422045e~sc_324.232"]},
{"title": "The William Vale", "description": "The William Vale, located in Brooklyn’s Williamsburg neighborhood,\nrests along the East River’s waterfront.\nThis soaring 23 story hotel features 183 guest rooms and suites, each with their own balcony, and 20,000 square feet of unique event spaces perfect for hosting a range\nof events.  \n\nThe William Vale’s selection of indoor and outdoor spaces, sweeping views, and unparalleled service is bound to leave a lasting impression for all of your wedding weekend events. All catering and service is provided by Chef Andrew Carmellini and the team at NoHo Hospitality Group.\n\nAsk about our Winter Wedding Special for preferred rates on food, beverage, room blocks and suites! For any December-March wedding inquiries.", "rating": "4.7", "number": "(646) 333-9087", "location": "111 North 12th Street, Brooklyn, NY", "photos": ["https://media-api.xogrp.com/images/0666294c-1948-4635-9090-949678705650~sc_324.480", "https://media-api.xogrp.com/images/3e219160-38d7-4a62-a8eb-d97ba8f0a3af~sc_324.232", "https://media-api.xogrp.com/images/9ebc2394-20c1-4c1a-b255-eca1b40862ba~sc_324.232"]},
{"title": "Dobbin St", "description": "One of Williamsburg’s brightest venues Dobbin St hosts weddings and events in Brooklyn, NY. This renovated warehouse space offers couples the chance to celebrate in style, supported by attentive staff and modern facilities. Located in one of New York City’s most desirable neighborhoods, it is easily accessible from all 5 boroughs. The property's address code also includes many great accommodation options for out of town guests.  \n\nSituated in beating the heart of cool New York, Dobbin St lives up to its location. \nAffectionately dubbed ‘The Blue Building’, its striking color distinguishes it from the other properties of the neighborhood and boldly announces its presence. Inside the gallery space exudes industrial-chic with exposed brickwork throughout and a polished concrete floor. This converted warehouse is incredibly roomy and features a raised ceiling which is crisscrossed by ventilation pipes that lend it character. Artfully decorated in a minimal style, here the past and present of Williamsburg meet. Outside, guests will find a picturesque setting for a dream New York City wedding. Couples can exchange vows with Manhattan’s iconic skyline as their backdrop, before spending the evening celebrating on the rugged wood decking. As night falls, elegant string lighting casts a warm glow over the party as loved ones celebrate together. \n\nDobbin St’s staff provide attentive service to accompany this stunning venue. Offering inclusive packages, they work with Brookyln’s best wedding professionals to tailor each event for the couples at its center. They can provide furniture rentals and the gallery space comes set up for a party with a full surround sound system. The venue can accommodate a large guest-list of up to 275 loved-ones for an unforgettable evening in the ‘Burg. The management also has strong partnerships with some of the city’s best culinary professionals, including some of its most lauded kosher caterers.", "rating": "5", "number": "(718) 302-0400", "location": "64 Dobbin St, Brooklyn, NY", "photos": ["https://media-api.xogrp.com/images/85d97299-183f-4554-a139-a819193b37ce~sc_324.480", "https://media-api.xogrp.com/images/a0f1d406-6b46-4933-ac77-a9d4db84ffb6~sc_324.480", "https://media-api.xogrp.com/images/b71220f0-120e-468a-97af-1a8617de3a7e~sc_324.232", "https://media-api.xogrp.com/images/d86b9aee-0d81-4150-a9e7-a556515973c5~sc_324.232"]},
{"title": "Bryant Park Grill", "description": "Bryant Park Grill is cozily situated behind the landmark New York Public Library in the delightful oasis of Manhattan's Bryant Park surrounded by London Planetrees modeled after those at the Jardin des Tuileries in Paris. Sophisticated and romantic, the restaurant is comprised of three areas: the Rooftop Terrace, the South Garden, and the Interior Grill Dining Room. From the first meeting to the very last toast, our dedicated team of event planners will do everything to ensure your wedding feels exclusive and- most importantly - designed just for you.\n\nServices Offered\nA variety of all-inclusive packages are available for your perusal. All packages include the cost of chairs, tables, glassware, flatware, china, and floor length linens. Setup and cleanup service is always provided. Chair covers, a dance floor, a tent and tent accessories, and general decor can be added to your package if desired. All areas are wheelchair accessible.\n\nCuisine\nChef Gadi Weinreich and Pastry Chef Anne-Marie Noonan are happy to craft a wedding day menu that meets your needs and dietary preferences. Both plated and buffet-style options are available, and passed hors d’oeuvres and stations of your choice are served during your cocktail hour. A chocolate fountain can be added to your package upon request. Bryant Park Grill features an extensive whiskey selection and a variety of classic cocktails. While you will need to secure an outside cake vendor, Bryant Park Grill is happy to provide complimentary cake cutting services.\n\nLocation\nBryant Park Grill is conveniently situated within the city’s beloved Bryant Park just behind the landmark New York Public Library. A variety of park activities and excursions including ice skating, film festivals, and more are available but dependent on the season.", "rating": "5", "number": "(212) 206-8815", "location": "25 West 40th Street, New York, NY", "photos": ["https://media-api.xogrp.com/images/b7b2ef52-f335-45cf-9400-89b879d548e6~sc_324.480", "https://media-api.xogrp.com/images/35b4c895-f893-4e1e-9a35-0dd7ca726400~sc_324.232", "https://media-api.xogrp.com/images/e8bdd938-476b-4864-be04-73935bbbf18f~sc_324.232"]},
{"title": "The Box House Hotel", "description": "The Box House Hotel is a rooftop wedding venue located in Brooklyn, NY. This urban upscale destination provides a sophisticated setting for special celebrations. Original factory details blend with modern interiors and accents, resulting in a timeless aesthetic that can be tailored to reflect your vision. Mark your nuptials journey in style, overlooking the iconic NYC skyline, surrounded by those you love most in the world.\n\nYou can celebrate every stage of your romantic love story at this elegantly appointed rooftop reception venue. From engagement parties, wedding showers, and rehearsal dinners to the main day itself, The Box House Hotel accommodates all styles of events. Exchange vows in an intimate elopement, micro wedding, interfaith or non-religious ceremony. Outdoors, with the option of the retractable rooftop being open or closed, you can say “I do” in a city-chic setting. The penthouse terrace is transformed for evening receptions, with ambient string lights, candlelight, fairy tale florals and greenery, and space for dinner and dancing.\n\nThe experienced event team delights in curating unique occasions for their cherished clients. They will be by your side from sound boarding ideas and design options to arranging in-house catering and vendor referrals. The expert culinary team creates delicious buffets, stations, hors d’oeuvres, and formal plated meals to suit your tastes and preferences. Seasoned bartenders oversee champagne toasts and serve premium liquors, wine, beer, and cocktails. You can connect with the in-house coordinators at The Box House Hotel today to explore destination wedding packages, timelines, floorplans, and more.\n\n----\n\nIf you are looking to serve a delicious meal to your guests outside of The Box House Hotel we are more than happy to cater your wedding with our award winning food and service! We are a full service caterer, which means we provide all of the necessary staff and catering equipment (flatware, glassware, chaffing dishes, etc). We will work with you to cater your event by offering you access to our event coordination team, chefs, bartenders, and service managers to take you through the entire food & beverage planning process. We will also be there the day of your wedding to execute and coordinate the food & beverage service; canapé to dessert!", "rating": "4.9", "number": "(718) 383-3800", "location": "77 Box Street, Brooklyn, NY", "photos": ["https://media-api.xogrp.com/images/bcaee4a8-e8bd-4647-ab80-f0dcb9017896~sc_324.480", "https://media-api.xogrp.com/images/eed6e5bf-a45f-44fe-ac9b-6c6286a62139~sc_324.480", "https://media-api.xogrp.com/images/f4cf1b69-ebea-42ef-a65c-213288943bd4~sc_324.232", "https://media-api.xogrp.com/images/3bcdcff6-f0da-4fad-9878-636ad83ab7a8~sc_324.232"]},
{"title": "620 Loft & Garden", "description": "Situated in New York, NY, 620 Loft & Garden is a unique rooftop wedding venue overlooking the luxurious Fifth Avenue. From here, couples and guests can feast their eyes on the dramatic cityscapes and savor in the tranquility away from the city's hustle and bustle. Serenity, magic, and romance await couples looking to host a wedding of a lifetime.\n\n620 Loft & Garden boasts a historic manicured garden, a sparkling reflective pool, and a tasteful fountain to add to the elegant setting. The loft is fully customizable, brightened by wall-to-wall windows, flooding the indoors with the city's splendor. The venue welcomes the pair-of-honor to wed during every season. A portion of its garden is tented year-round to accommodate a comfortable celebration regardless of the weather. As the seasons change, so do the views. Famous landmarks like the Rockefeller Center Christmas Tree and Ice Skating Rink serve as a bonus for the winter festivities. In the spring and summer, loved ones are welcome to the sights of the Prometheus Fountain and Radio City Music Hall marquee. The loft can accommodate receptions of up to 165 guests indoors and outdoors and a sit-down meal of 120 people. \n\nThe team at 620 Loft & Garden has everything a couple might need to make the day extra special. The venue has a list of preferred vendors that includes everything from the lighting to the photography on the day. The loft also offers all-inclusive packages to aid a low-stress and full-service planning experience. The venue is wheelchair accessible, allowing a comfortable and safe event for all family and friends arriving for the occasion.", "rating": "5", "number": "(212) 593-9499", "location": "620 Fifth Avenue, New York, NY", "photos": ["https://media-api.xogrp.com/images/52717ee6-d486-4640-845e-a0de5ac7383c~sc_324.480", "https://media-api.xogrp.com/images/c61fc5e9-a976-4547-afce-e5b326194681~sc_324.480", "https://media-api.xogrp.com/images/73252f6d-208e-467b-a581-bc8ae7f06a75~sc_324.232", "https://media-api.xogrp.com/images/9938021c-fd0e-4c39-960a-b2da27e01e15~sc_324.232"]},
{"title": "Manhattan Penthouse", "description": "Manhattan Penthouse is located in Union Square. Palladian windows are located throughout the loft-like space, providing panoramic views of New York City. The venue can accommodate up to 180 guests, perfect for corporate functions, weddings, and other social events.", "rating": "4.7", "number": "(212) 627-8838", "location": "80 Fifth Avenue, New York, NY", "photos": ["https://media-api.xogrp.com/images/d3122952-3ad9-4635-8bd1-49f65ef58032~sc_324.480", "https://media-api.xogrp.com/images/12165ec1-3116-4e3f-bdac-35c6763fe8d4~sc_324.480", "https://media-api.xogrp.com/images/7a6ac92b-075b-4008-83a7-54fd29a6d943~sc_324.232", "https://media-api.xogrp.com/images/9ac830a4-beb9-4201-9833-bc7ae17f2402~sc_324.232"]},
{"title": "3 West Club", "description": "3 West Club is a wedding venue and hotel located in New York, NY. Situated amidst the splendor of Rockefeller Center and only minutes from Radio Music Hall, this historic mansion invites couples to enjoy a one-of-a-kind experience. Featuring spacious event rooms and an exquisite rooftop terrace, this beautiful venue has plenty to delight and inspire.   \n\nThe history of 3 West Club is entwined with that of the famous Rockefeller Center. The site on which the modern Center sits was chosen, in 1926, to be the new home of the Metropolitan Opera. The project proved to be too expensive for the Met to fund, however, and John D. Rockefeller Jr. was persuaded to contribute his support. When plans for the new opera house were abandoned in 1929, Rockefeller entered into negotiations to build a mass media complex on the site. The new plans included facilities for television, music, radio, and theater. Construction on the Center began in 1931; over the course of the following decades, the project grew in scope and scale. Rockefeller Center was declared a New York City landmark in 1985 and a National Historic Landmark in 1987. The hotel is listed on the National Register of Historic Places. \n\nThe modern 3 West Club is renowned for its blend of elegance and comfort. The venue boasts a number of exquisite event spaces. Each has its own distinctive style. The majestic Grand Ballroom is the venue’s largest facility. Featuring crystal chandeliers of Austrian design and accessed by a breathtaking marble staircase, the Grand Ballroom is a perfect setting for your wedding celebration. The Grand Salon is another truly delightful space. Two fireplaces, set on opposite ends of the room, are topped with beautiful marble mantelpieces. Two large mirrors, placed above each fireplace, draw the viewer’s attention to the room’s chandeliers and add a wonderful sense of depth to the room. The Lounge is a lovely, welcoming place. Featuring sumptuous carpets and a tinkling baby grand piano, it is an ideal spot for more intimate gatherings. The Solarium’s glass wall and large outdoor terrace present a stunning view of the city and make it a favorite for dinners and receptions.    \n\n3 West Club offers couples wedding packages with different menus and options. Packages include complimentary ceremony rehearsal space, preferred guest hotel room rates for wedding guests, and private menu tasting and consultation with the venue’s executive chef. Wedding packages also include the assistance of a wedding coordinator and a maître d’ to ensure that every aspect of your day runs smoothly and according to your wishes.", "rating": "5", "number": "(212) 582-5456", "location": "3 West 51st Street, New York, NY | Tri-State Area,", "photos": ["https://media-api.xogrp.com/images/6dc522ed-9e5b-4407-8320-95eb4ebac79f~sc_324.480", "https://media-api.xogrp.com/images/4b9a7476-b16f-42e2-a236-0da80bf5870a~sc_324.480", "https://media-api.xogrp.com/images/2010b409-4467-4b67-8e75-23eb3d39b958~sc_324.232", "https://media-api.xogrp.com/images/1fc90394-0db7-45a5-af34-249e638cdb90~sc_324.232"]},
{"title": "One if by Land, Two if by Sea", "description": "One if by Land, Two if by Sea is a romantic restaurant based in New York, NY, that hosts weddings and events. Known for its beautiful decor and classic menu offerings, it is a magical setting to host your fairy tale. Founded in 1973, the restaurant boasts a timeless charm and warm ambiance that creates the perfect atmosphere for your special day. \n\nOne if by Land, Two if by Sea has a selection of event spaces for you to choose from. The Main Dining room is dimly lit by breathtaking chandeliers and candle-lit tables that complement the warmth of the exposed brick walls. This room also has large windows and a unique stained glass window, adding a unique element to the space. It can accommodate up to 130 guests for a seated dinner and 200 for a cocktail reception. For those hoping to host a more intimate gathering, The Mezzanine is a fantastic choice, featuring hardwood floors and a welcoming atmosphere. \n\nWedding packages at One if by Land, Two if by Sea include room rental, food and beverages, floral arrangements, and live music to entertain guests. Your evening can begin with an open bar cocktail reception followed by a delicious three-course dinner accompanied by red and white wine. Contact the team today for more information on how they can host the wedding of your dreams.", "rating": "5", "number": "(212) 255-8649", "location": "17 Barrow St, New York, NY", "photos": ["https://media-api.xogrp.com/images/4a98b3d0-5667-426d-a3f7-c6c947f79f2b~sc_324.480", "https://media-api.xogrp.com/images/f01ef437-a529-4227-ad58-6882542de988~sc_324.480", "https://media-api.xogrp.com/images/b6ea3f49-7a43-4690-99c6-7d2a030a9b2f~sc_324.232", "https://media-api.xogrp.com/images/8f4aa20e-cddf-4f6c-934b-50e8cafb4506~sc_324.232"]},
{"title": "City Cruises - New York", "description": "With the iconic New York, NY skyline as the backdrop, City Cruises - New York provides an unforgettable venue for weddings and other special events. Sail along the Hudson and East Rivers while you dance the night away underneath the stars. The expert staff will do everything they can to provide a seamless experience for you and your loved ones. \n\nCity Cruises - New York has a large fleet of vessels,  so you are sure to find one that fits your vision for your big day. These luxurious yachts offer climate-controlled interiors and open-air exteriors where you can celebrate your occasion in style. They can accommodate events of nearly all sizes, with capacities ranging from 125 to 425 people. Each one can act as a blank canvas on which you can create your one-of-a-kind occasion. They can set up a dance floor or photo booth to enhance your festivities. No matter where you are on the ship, you can be 'wowed' by breathtaking views of the Big Apple. You can view famous monuments, like the Empire State Building, the Statue of Liberty, and the Brooklyn Bridge.\n\nThe team at City Cruises - New York offers a variety of all-inclusive packages so you can personalize your services based on your specific needs. An in-office coordinate is available to help ensure your day runs smoothly. Friendly bartenders can serve your loved ones delicious libations all night long. For your dining experience, you can have the talented chefs design a mouthwatering meal you'll remember for years to come. Dishes can be served plated, buffet style, or at stations. They also offer a number of entertainment options that can make your night unforgettable. To elevate your event, you will have access to their list of carefully curated vendors.", "rating": "5", "number": "(646) 576-8400", "location": "62 Chelsea Piers, New York, NY", "photos": ["https://media-api.xogrp.com/images/5793fd3a-8ec1-4190-b8fd-3740328ef7f2~sc_324.480", "https://media-api.xogrp.com/images/486671dc-f7d4-408e-b47e-9bef955d4441~sc_324.480", "https://media-api.xogrp.com/images/b252b194-15f3-469f-b861-08cbe94e3206~sc_324.232", "https://media-api.xogrp.com/images/297181ca-817e-4906-96b3-2649433d7c9c~sc_324.232"]},
{"title": "Ace Hotel Brooklyn", "description": "Ace Hotel Brooklyn, NY is an upscale hotel welcoming weddings, newly opened in Summer 2021. You and your guest are invited to celebrate in upscale style surrounded by works by local artists in a creative and industrial-inspired setting. With ample space for large parties, its staff will support you on every step of your wedding journey.\n\nSituated in the heart of trendy Brooklyn, the Ace Hotel lives up to its borough’s stylish reputation. Its eye-catching interior combines industrial elements that nod to the grand modernist architectural tradition. Such lofty design is in turn grounded by the use of warm, upscale, and tactile materials throughout. Wooden finishes soften the raw concrete of its ceilings, while comfortable furnishings invite your guests to sit back and relax. With multiple skylights throughout everything is cast in relief with striking shadows creating a sense of depth as you wander through the building. Your guests will be equally impressed by the large scale artworks that punctuate the hotel’s decor, paying homage to the area’s artistic roots. Due to its central location, it is a convenient choice that benefits from New York City’s extensive domestic and international travel networks. In the days surrounding the ceremony, you and your loved ones can take in the charming neighborhood of Boerum Hill. Well-connected, you can also grab the subway directly downtown to catch a show and see the sights of Manhattan.\n\nThe Ace Hotel Brooklyn is offered as a canvas which you can use to create the event of your dreams. The hotel can accommodate parties of up to 200 guests with enough rooms to ensure everyone has a peaceful night’s sleep after the festivities have ended. The staff can assist you by providing catering services, rental of event items, and more.", "rating": "5", "number": "(718) 313-3636", "location": "252 Schermerhorn Street, Brooklyn, NY", "photos": ["https://media-api.xogrp.com/images/82d75977-558f-474d-b7f2-7fc44b5e3665~sc_324.480", "https://media-api.xogrp.com/images/8a13570a-6ecc-4ec1-83c6-ea8e1d12b115~sc_324.480", "https://media-api.xogrp.com/images/361b6d28-b4e6-4819-8ceb-211f012398d5~sc_324.232", "https://media-api.xogrp.com/images/ac4285a8-1ccd-4858-9410-d31e7396835c~sc_324.232"]},
{"title": "Robert at the Museum of Arts and Design", "description": "Robert is a restaurant wedding venue located in New York City, NY. Situated atop the Museum of Arts and Design, Robert is a modern classic offering incredible views of Central Park and Columbus Circle. This classic modern American restaurant was designed specifically for entertaining guests and offers an elegant and romantic setting. For a sophisticated and refined atmosphere, Robert provides an ideal location for a stylish wedding. \n\nNamed for an award-winning designer, Robert Isabell, the restaurant celebrates design and beauty through both its décor and an innovative seasonal menu designed by Chef Armando Cortes. The spaces at this venue boast eclectic colors, chandeliers, and  lounge sofas to create a sophisticated and contemporary setting. Couples are welcome to host an informal ceremony alongside the reception in Robert for up to 75 guests. They will also have the option of renting the 7th-floor private museum space or the MAD theater, which seats up to 143 people. This beautiful event space offers the perfect setting for a New York wedding. \n\nThe team at Robert works hard to ensure that each couple receives a personalized experience. An expert organizational team is available to assist couples in planning every detail of the timeline and event space. Couples will be given multiple options for catering as well as an extensive wine and beverage list. A comprehensive wedding package is offered and includes a five and a half hour event, a deluxe open bar, complimentary Tuscan Station, a seated 3-course menu, and a selection of wines. Whatever your wedding vision looks like, the team at Robert is determined to make your experience as enjoyable as possible.", "rating": "5", "number": "(212) 206-8815", "location": "2 Columbus Circle, New York, NY", "photos": ["https://media-api.xogrp.com/images/98771518-9954-4f24-8e24-1984a3bc6a98~sc_324.480", "https://media-api.xogrp.com/images/aea6ca4f-2c97-43dc-a41e-05af250047d6~sc_324.480", "https://media-api.xogrp.com/images/9f7253bb-e8fb-4514-a0e5-fe0ab4681dcf~sc_324.232", "https://media-api.xogrp.com/images/e9d4a28d-fec9-4358-8ccf-14f75ea49fa1~sc_324.232"]},
{"title": "Conrad New York Downtown", "description": "Conrad New York Downtown is an all-suite, luxurious hotel situated alongside the Hudson River. Surrounded by greenery, the New York Harbor and iconic Downtown Manhattan landmarks, our surroundings are ideal for your most memorable wedding photos.\n\nDiscover the beauty of saying \"I Do\" at Conrad New York Downtown. Featuring 30,000 square feet of flexible event space and 463 suite accommodations, our expert Catering team will help you create a custom tailored wedding experience unique for your big day.\n\nDanny Meyers Union Square Events is the exclusive food and beverage partner for Conrad New York Downtown. Producing one-of-a-kind menus and unparalleled dining experiences, Union Square Events will craft and execute custom unique menus designed specifically for you, highlighting the finest local and seasonal ingredients.", "rating": "5", "number": "(646) 769-4200", "location": "102 North End Avenue, New York, NY", "photos": ["https://media-api.xogrp.com/images/00628ff9-dc61-4388-8f0b-fe6cd3293476~sc_324.480", "https://media-api.xogrp.com/images/40209d5d-16f8-4dd5-8d65-910af0edc125~sc_324.480", "https://media-api.xogrp.com/images/0cc33071-fb7c-4894-80a6-df40d991d00b~sc_324.232", "https://media-api.xogrp.com/images/a63369b4-48bf-410e-890e-02a7b663eaf7~sc_324.232"]},
{"title": "JW Marriott Essex House New York", "description": "JW Marriott Essex House New York is a hotel wedding venue overlooking Central Park and the iconic New York, NY skyline. This historic Manhattan setting welcomes you to celebrate your love in the lap of luxury. From its glamorous ballrooms overflowing with gold detailing to the swoon-worthy newlyweds' suite and terrace, an unforgettable day awaits you. Just beyond the doors lies the natural splendor of Central Park, as well as iconic nightlife venues for the days leading up to your nuptials. \n\nJW Marriott Essex House New York is perfect for both intimate and grand events with up to 200 seated guests. Begin your day getting pampered in your luxurious complimentary suite, feeling positively royal. You can even request a suite with a terrace overlooking Central Park, creating a picture-perfect backdrop for your couples' portraits later on. After a last-moment touch-up and a toast for the nerves, you'll lead the way to your ceremony spot to exchange your vows. The venue's Grand Salon can play host to both your ceremony and reception, allowing you to hold each milestone of your day in one setting. After its evening transformation, the salon is ready to host a beautifully lavish celebration that will leave each of your guests breathless. Its Beaux Arts-style aesthetic is made even more timeless with hand-painted murals, crystal chandeliers, and original art deco craftsmanship. This ballroom also opens up to the Petit Salon, which is ideal for an elegant cocktail hour or mingling in between your favorite songs on the dance floor. \n\nUpon booking your celebration at this one-of-a-kind venue, their expert event planners will get to work bringing your wildest dreams to life. The hotel also boasts an exceptional in-house catering team operating out of its SOUTHGATE Bar and Restaurant. Known for its delicious American cuisine and sophisticated presentation, they'll curate the best possible menu for your event. You'll have all-inclusive packages to explore, which may include catering, drinks, wedding cakes, rental equipment, and of course, a dedicated team to bring it all together. To top it all off, you and your loved ones can indulge in some pre-wedding pampering in their spa facilities. Whether you opt for a relaxing massage or body treatment, you'll look utterly flawless before saying, 'I do.'", "rating": "5", "number": "(212) 484-4618", "location": "160 Central Park South, New York, NY", "photos": ["https://media-api.xogrp.com/images/ecc7eab3-40b2-497e-8d0e-ffec6c722898~sc_324.480", "https://media-api.xogrp.com/images/09c7ced2-cddc-4332-ba17-1200600685ba~sc_324.480", "https://media-api.xogrp.com/images/75db569a-4220-4974-8e90-8f7c973e7f55~sc_324.232", "https://media-api.xogrp.com/images/f9bf12c1-82ed-483e-8bb5-1e0ade69e6f4~sc_324.232"]},
{"title": "Museum of the City of New York", "description": "Celebrating its 100th year on Fifth Avenue’s iconic Museum Mile, the Museum of the City of New York is the perfect place for special events—weddings, bar/bat mitzvahs, corporate dinners, birthdays, graduations, holiday parties, and more! Guests pass through the Museum’s stately Fifth Avenue Terrace, and into the beautiful Rotunda—the towering highlight of this grand Georgian-style mansion. The Museum’s dazzling contemporary light installation, Starlight, accentuates a sweeping marble staircase leading up to the second floor where a reception hall, complete with French doors, overlooks Central Park. The front courtyard and Pontarelli Terrace are delightful in the summer months, and can be tented in any season.", "rating": "5", "number": "(917) 492-3402", "location": "1220 Fifth Ave, New York, NY", "photos": ["https://media-api.xogrp.com/images/a0eaa8c4-a565-4200-b644-fb7470817067~sc_324.480", "https://media-api.xogrp.com/images/e1b27527-7704-47b7-a241-8a6fe2584f6c~sc_324.480", "https://media-api.xogrp.com/images/ef129ce6-fc6d-46da-91c8-1339ea4ea5ae~sc_324.232", "https://media-api.xogrp.com/images/c9aceea4-4dbe-4b39-8f37-bcb45770ff22~sc_324.232"]},
{"title": "InterContinental New York Barclay", "description": "Located in New York, NY, the InterContinental New York Barclay is an upscale urban wedding venue and is situated just moments from Park Avenue, in the heart of Manhattan. This sophisticated hotel was originally built in 1926 and has been renovated to reflect contemporary style and comforts, while also retaining its traditional charm.\n\nAt the InterContinental New York Barclay, you can look forward to a seamless celebration marked by timeless taste and classic refinement, with a dash of modern flair. The purpose-built event space was designed with today's couples in mind and includes a grand staircase for your big entrance and numerous elegantly-appointed ballrooms. The Grand Ballroom is ideal for ceremonies and receptions alike and has a capacity for 400 or 300 guests respectively. Characterized by romantic chandeliers and Chinoiserie-inspired upholstery, this ballroom sets the tone for lavish celebrations with those you love. Color-coordinated uplighting lends a subtle touch of contemporary style to proceedings and a spacious dance floor ensures your guests can enjoy your chosen entertainment. Similarly, the Empire Ballroom can be curated for both ceremonies and receptions for up to 300 loved ones and features beautifully-appointed interiors and atmospheric lighting. The Gallery is home to a stunning grand staircase and no less than 8,000 crystals and plush carpeting. For more intimate gatherings and micro weddings, the Barclay Salon is a suitable choice and is decorated in a similar fashion to the aforementioned ballrooms.\n\nThe InterContinental New York Barclay is home to luxurious accommodation that includes 704 rooms and 32 suites in total. Loved ones can enjoy a relaxing stay in one of the world’s most iconic cities. The suites and guest rooms are decorated in their own unique way with local artworks and homages to the 1926 original building adding character and culture to your experience. The expert planners and event staff will be on hand to bring your vision to life, offering guidance with everything from menu and beverage selections to decor and more.", "rating": "5", "number": "(212) 906-3100", "location": "111 E 48th Street, New York, NY", "photos": ["https://media-api.xogrp.com/images/f7706713-5c42-409d-aabe-5c2d2c97e1d3~sc_324.480", "https://media-api.xogrp.com/images/2b729c19-5916-4a27-bcfe-f65660fa5330~sc_324.480", "https://media-api.xogrp.com/images/68415fea-7c36-4283-9f4e-1062d5f6177e~sc_324.232", "https://media-api.xogrp.com/images/76935a44-0d3a-4b87-8ce4-2df8bf75b2a5~sc_324.232"]},
{"title": "Houston Hall", "description": "Houston Hall is a historic wedding and event space located in New York, NY. Offering a storied charm, a wealth of space, and a myriad of layouts, this stylish spot is an ideal setting for a contemporary celebration. Filled with natural light and classic charm, you and your guests are sure to revel in the sophistication of this celebrated setting. \n\nIn 1907, Houston Hall began its story as an FBI garage. After over a century of iterations, today, this venue offers a wealth of personality and charm in every facet. Maintaining that historic, industrial feel, you are sure to enjoy the storied atmosphere of this celebrated space. The main hall of this venue can welcome up to 180 guests, with a spacious, bright feel even at full capacity. The high ceilings and six skylights allow for plenty of natural light, ensuring your smile shines bright in all your wedding photos. An elegant, white marble bar welcomes you and your guests to relax and be refreshed by their experienced, accommodating bartenders. As an added touch, you can also enjoy their get-ready room filled with amenities to help you prepare for your big day. \n\nTo ensure each event runs smoothly, Houston Hall offers couples an experienced and accommodating coordinator for their special celebration. From the first consultation to the big day itself, they want to help you host an event tailored to your personality and style. Additionally, the renowned catering team at this venue can provide you and your guests with a delectable feast for your special celebration. Other services, such as furniture and equipment rental, are available from this resourceful venue.", "rating": "5", "number": "(212) 675-9328", "location": "222 West Houston St, New York, NY", "photos": ["https://media-api.xogrp.com/images/aaceb3e0-58cf-476e-b696-071bd80fcad4~sc_324.480", "https://media-api.xogrp.com/images/67ddd5c7-2a79-473e-a947-1aaf184eb0f7~sc_324.480", "https://media-api.xogrp.com/images/67ef571c-ae5c-4da0-9e80-0af18f31e268~sc_324.232", "https://media-api.xogrp.com/images/5668897d-dc2c-427b-a43c-be9e3cd4047c~sc_324.232"]},
{"title": "The View at The Battery", "description": "The View at Battery Park is a wedding venue located in New York, New York. Located on the southern tip of Manhattan, this waterfront property features sweeping harbor views. Create wedding ceremonies and receptions that are casual and intimate or grand and upscale at this versatile venue. You and your guests can celebrate your nuptials in an elegant fashion, both indoors and outdoors.\n\nUpon arriving at The View at Battery Park, you'll notice its location directly adjacent to the stunning Battery Park gardens and the whimsical SeaGlass Carousel. With magic already in the air, this waterfront property features two floors which allow unobstructed views of Ellis Island and the Statue of Liberty. Say 'I do' outdoors underneath a mature tree with the New York Harbor in the background. This romantic space is just one of a few alfresco spaces for your romantic ceremony. While you take advantage of the stunning photo opportunities, host a lively cocktail hour at their beer garden or in their elegant indoor space. Inside, you'll find a gorgeously renovated interior. Large windows provide floods of natural light during the day and a unique vantage point of the sunset as you settle in for the evening. This venue offers a plethora of spaces to host the wedding of your dreams whether it's casual and laid back or elegant and formal.\n\nThe View at Battery Park can host up to 300 guests for indoor, outdoor, or tented wedding ceremonies and receptions. This venue welcomes religious, non-religious, and interfaith ceremonies in addition to civil unions, commitment ceremonies, and more. A professional wedding planner will provide guidance throughout the coordination process for the flawless execution of your dream day. Masterpiece Caterers creates a customized menu, from delivering hors d'oeuvres to the wedding party and seated dinners to desserts and bar packages. They provide their own experienced servers and bar staff. Rental items, including tents, are also available. This gorgeous wedding venue provides a wide variety of amenities for a hassle-free planning experience and an event that will be remembered for a lifetime.", "rating": "4.9", "number": "(212) 809-5508 ext. 2", "location": "1 Battery Park, New York, NY", "photos": ["https://media-api.xogrp.com/images/f45d7bec-ff85-49e1-a574-05c040d9cd04~sc_324.480", "https://media-api.xogrp.com/images/09023dc8-13e4-4708-990c-b32be2b91dee~sc_324.480", "https://media-api.xogrp.com/images/6d05b948-e8d8-4d21-bb8b-08a899047a60~sc_324.232", "https://media-api.xogrp.com/images/5313e6bf-5c08-45b5-b7ba-fe80614f87e0~sc_324.232"]},
{"title": "Royalton Park Avenue", "description": "Celebrate your love story in style and luxury at Royalton Park Avenue, a lavish hotel venue in New York City for weddings and nuptial events. A masterful blend of upscale, trendy, and residential, it creates an ideal ambiance for couples hosting their milestone in the heart of Manhattan. Nothing excites the team more than precious moments, and they look forward to working with you on the event of a lifetime. \n\nWhat sets Royalton Park Avenue apart are its artfully designed spaces. All-glass exteriors welcome guests from the outside, and once inside the designer lobby, they come face-to-face with street-peering panoramas of busy Park Avenue. Its ballrooms and function areas are just as chic; among these is the Park Avenue Ballroom, located on the hotel's third floor. Colossal windows flood the room with natural warmth and light, and high ceilings offer maximum space for ceremonies and receptions of any size. For cocktail sipping, socializing, or more intimate celebrations, look no further than the Red Room, a 1,500-square-foot bar and lounge with an extensive menu of beers, liquors, and signature drinks. Guests are also welcome to wander out onto the open-air terrace for some of the best views this side of the Big Apple has to offer. Other event spaces include the sophisticated Ivy Room and Royalton Rooftop Lounge, just steps away from the 40-foot heated pool and exquisite rooftop deck. \n\nFrom sound and lighting to rentals and furniture, the staff at Royalton Park Avenue supply all the essentials for special occasions. Catering will be prepared by the hotel's in-house chefs, who are more than happy to collaborate with you on a custom menu. Guests staying the night can also look forward to the hotel's 249 luxury suites, complete with premium bedding, top-tier entertainment, and high-end amenities for an incredible stay.", "rating": null, "number": "(178) 699-95446", "location": "420 Park Avenue South, New York, NY", "photos": ["https://media-api.xogrp.com/images/652e0fe3-4304-4a4e-908c-fbd2e54c08a1~sc_324.480", "https://media-api.xogrp.com/images/309cfc70-ee28-4874-9f09-f344f8c44bf0~sc_324.480", "https://media-api.xogrp.com/images/7acfd1f9-bf7c-433f-a7f8-28612612a034~sc_324.232", "https://media-api.xogrp.com/images/e0251c30-030b-4ea7-8e75-b3edbe7cb3d5~sc_324.232"]},
{"title": "Prince George Ballroom", "description": "Located in New York City, Prince George Ballroom is a historic wedding venue within easy reach of Madison Square Park. Known for its Neo-Renaissance details, the locale has been a notable landmark in the area for more than 100 years. With a number of spaces available for events, the venue offers an unforgettable nuptial setting.\n\nPrince George Ballroom was built in 1904 and was a part of the Prince George Hotel, which featured restaurants and was a common meeting place. It was designed by architect Howard Greenley in a Beaux-Arts style that blended classic and Neo-Renaissance touches. Instantly iconic, the building evoked the grandeur of buildings constructed in France during the 1800s. Throughout the first half of the 1900s, the hotel was a popular destination for tourists. After a decline in that industry, it then became a homeless shelter in the 1980s, until falling into disrepair. Breaking Ground, in partnership with other organizations, stepped in during the 1990s and renovated the ballroom. Now, it is listed on the National Register of Historic Places, while still providing permanent supportive housing for those in need. Proceeds from events go to supporting Breaking Ground’s causes.\n\nUp to 300 guests can be seated in the Prince George Ballroom and smaller gatherings of up to 55 people can take place in the Tea Room. For a more contemporary backdrop for festivities, couples can book The Gallery for their event. A list of reputable vendors is provided to each couple, including photographers, event coordinators, and caterers. With gold Chiavari chairs, a hardwood dance floor, and a baby grand piano, couples and their guests can dance and dine surrounded by a sense of sophisticated splendor. The versatile spaces are suitable for both ceremonies and receptions, as well as other events. Featuring recent renovations, such as eco-friendly lighting, the elegant venue offers a stunning walk through time as couples dance into the future.", "rating": "4.8", "number": "(212) 471-0870", "location": "15 East 27th Street, NEW YORK, NY", "photos": ["https://media-api.xogrp.com/images/06a0c8fd-db34-48b1-9f20-3779cdecb72a~sc_324.480", "https://media-api.xogrp.com/images/32d5217d-6a71-4dad-ae8e-b7757fbaa6a1~sc_324.232"]},
{"title": "Celebrate at Snug Harbor", "description": "Celebrate at Snug Harbor is a year-round idyllic wedding venue located in Staten Island, NY. Boasting 83 acres of land, this venue offers flourishing gardens and landscapes alongside their historically designed indoor spaces. Its breathtaking backdrops and dedicated onsite team will be sure to make your special day into an unforgettable celebration.\n\nThe versatile grounds at Celebrate at Snug Harbor can host an array of events, from intimate weddings to extravagant celebrations. During your big day, you will be free to explore all the botanical gardens that the venue offers. The Tuscan Garden can accommodate up to 250 guests among the manicured topiaries, water features, and dutifully maintained topiaries. In the Chinese Scholar Garden, couples can stroll along the bridges and walkways, and take photos among the peaceful koi ponds and breathtaking architecture. Vibrant blooms, hedge mazes, and tree-lined pathways are present throughout the grounds, to give your ceremony, first look, or photo sessions a visually-rich background. For vintage-style indoor receptions, you will be free to use their largest ballroom, the Great Hall. Elegant chandeliers hang from its 40-foot-high ceilings, while large Palladian windows cover events with plenty of natural light. In addition, the Tented Pavilion features delicate drapery, elegant chandeliers, and an unobstructed view of the flourishing gardens.\n\nThe onsite team of event planners will work closely with you, and help you organize and design the wedding of your dreams. Celebrate at Snug Harbor welcomes couples from all walks of life and will customize their packages to match your specific needs and wants. The catering staff will customize your menu, to incorporate your favorite cuisines and flavors during your event.", "rating": "4.6", "number": "(718) 442-2700", "location": "1000 Richmond Terrace, Staten Island, NY", "photos": ["https://media-api.xogrp.com/images/9f553633-183b-4eef-830c-9b5a35eb9abd~sc_324.480", "https://media-api.xogrp.com/images/9a4936f7-6e1f-42aa-98fa-bfb629b92127~sc_324.480", "https://media-api.xogrp.com/images/8def8375-fe0d-4b37-baee-cb097d9fcf73~sc_324.232", "https://media-api.xogrp.com/images/fc6421f8-8e01-403e-a97a-4b590057026e~sc_324.232"]},
{"title": "Sixty Pine Street", "description": "Located in New York City, NY, Sixty Pine Street is the newest location by Masterpiece Caterers.  It replaced One Hanover Square after loosing the property during the pandemic.  Sixty Pine Street is a historic estate and ballroom venue for weddings and other milestone occasions. This venue's team invites you to select the renovated elegance of this facility as the setting of your special celebration. You and your loved ones may savor a truly remarkable event in this exquisite locale.\n\nSixty Pine has a history of more than 160 years, a landmark building situated in NYC's Financial District. With four levels and 11 event spaces, this facility is ready for intimate gatherings and gala extravaganzas alike. To-be-weds may relax and prepare in a get-ready room, and wedding parties may enjoy a beverage at the bar and lounge. The convenience and comfort of all guests are important to this venue's team. This building includes air-conditioning, wheelchair-accessible features, an elevator, and wireless internet.\n\nThe Masterpiece Caterers team has experience in providing full-service catering and other event services for wedding celebrations. These professionals will happily prepare a ceremony and reception for groups of between 20 and 300 guests. The venue team offers all-inclusive packages and on-site catering, bartending, planning, service staff, and cake. You and your guests may tuck into hors d'oeuvres and meals from buffets, family-style platters, chef stations, plated dinners, and more. This team can provide trained bartenders to pour your beverages, with options for a limited or open bar. Additionally, Sixty Pine Street hosts elopements, civil unions, commitment ceremonies, vow renewals, and second weddings. This is a venue where your special celebration can come to life.", "rating": "5", "number": "(212) 809-5508 ext. 2", "location": "60 Pine Street, New York, NY", "photos": ["https://media-api.xogrp.com/images/795d407f-1aba-4e5a-86c0-bf488fbac3fb~sc_324.480", "https://media-api.xogrp.com/images/1a7e9fcd-98b5-4f2d-ab3d-c71f5eb5e3b9~sc_324.480", "https://media-api.xogrp.com/images/0b549674-b0da-4e3b-ae5d-a95faaa1072a~sc_324.232", "https://media-api.xogrp.com/images/2022ab6a-23b6-483a-8038-6fb62665d906~sc_324.232"]},
{"title": "Midtown Loft and Terrace", "description": "Located in New York City, Midtown Loft & Terrace is a wedding venue where couples can swap vows against the backdrop of the Empire State Building. This elegant locale in Manhattan is an urban retreat offering two spaces for celebrations. With an elevated ambience, the venue’s design easily complements a variety of wedding themes, creating a sense of sophistication for a couple's soiree.\n\nThe staff at Midtown Loft & Terrace are dedicated to helping a future newlywed pair achieve their dream day. With a focus on high standards of customer service, they carefully attend to each detail with thought and precision. Their devotion to the details is something they take pride in, and they are enthusiastic about curating unforgettable fetes. All of this takes place in a prime location, with the iconic Manhattan skyline enveloping the venue. Landmarks such as the Marble Collegiate Church and stunning skyscrapers, provide a picture-worthy setting for festivities.\n\nThere are two spaces that may be used for events here. The first is Midtown Loft, which spans 5,000 square feet. Up to 300 people can enjoy a cocktail reception here, or 180 attendees for a sit-down dinner. It features a kitchen, climate control, and marble bathrooms. The high ceilings and sizable windows help infuse the space with energy while affording couples and their loved ones views of the surrounding area. Natural light fills the room, which highlights the gorgeous oak flooring. This versatile loft can suit a variety of wedding visions and related events. The venue also offers an open-air option, Midtown Terrace, which is fitting for gatherings of up to 150 guests. Its retractable rooftop makes it a year-round possibility and it has its own lobby and private elevator. For a timeless touch, the Terrace features a carved stone railing in white. Both the Loft and Terrace can help set the stage for a wedding to remember.", "rating": "4.9", "number": "(212) 537-0117", "location": "267 Fifth Avenue, New York, NY", "photos": ["https://media-api.xogrp.com/images/766fb7e0-882a-4363-923b-6f065748b44c~sc_324.480", "https://media-api.xogrp.com/images/673e79a1-737a-4c0d-b93c-486c64681118~sc_324.480", "https://media-api.xogrp.com/images/9b85b90b-7cc2-4b61-959a-1b75579e3d2b~sc_324.232", "https://media-api.xogrp.com/images/182a0189-a478-4ef5-adf0-89780e90b7e5~sc_324.232"]},
{"title": "The Ritz Carlton New York, Nomad", "description": "Welcome to The Ritz-Carlton New York, NoMad, a newly opened luxury hotel in the heart of New York City. Located in a blossoming neighborhood North of Madison Square Park, the hotel boasts two dedicated floors of over 10,000 square feet of event space featuring natural light, stunning decor, legendary service and creative catering by Michelin-starred chef José Andrés. \n\nFrom our Ritz-Carlton Ballroom to the Madison Terrace, a variety of unique indoor and outdoor venues await guests. Celebrants can carefully select a space that is a perfect fit for weddings, engagement parties and social or cultural celebrations of any kind. Our Ritz-Carlton Wedding Specialist is ready to make the occasion of your dreams a reality.", "rating": null, "number": "(212) 404-8400", "location": "25 W 28th St, New York, NY | Tri-State, Nationwide, International", "photos": ["https://media-api.xogrp.com/images/85cf03e8-a674-4665-b04f-a7520dc11c87~sc_324.480", "https://media-api.xogrp.com/images/98a08212-0454-4934-89ef-85b45d36caaa~sc_324.480", "https://media-api.xogrp.com/images/3ccd08dd-f80c-4755-9009-6d76bff8b624~sc_324.232", "https://media-api.xogrp.com/images/7ef65610-3f73-4ec2-80d3-c60cb7e10690~sc_324.232"]},
{"title": "Virgin Hotels New York", "description": "Atop the Virgin Hotels, a hotel wedding venue in New York City, sits a one-of-a-kind event space with panoramic views of the NoMad district and beyond. Couples can make the most of the 38th floor, which has become the most coveted venue in the city to host their wedding celebrations. You will also find that this space is incredibly adaptable and flexible to accommodate your vision. \n\nThe food and beverages served here will easily be one of the highlights of your big day as well. The hotel is home to 460 guest rooms and holds itself to a standard of hospitality like no other. Expect to start your \"Happily Ever After\" in the most magical way.", "rating": null, "number": "(646) 307-9630", "location": "1227 Broadway, New York, NY", "photos": ["https://media-api.xogrp.com/images/d07a62d0-6d93-4eee-af45-6b540ac24b8f~sc_324.480", "https://media-api.xogrp.com/images/78d8e1e1-9320-454e-9659-7d7eecfbc7ae~sc_324.480", "https://media-api.xogrp.com/images/0991b8fe-d3a1-4ef9-a2e3-0b27aa6e8d85~sc_324.232", "https://media-api.xogrp.com/images/2a41f8eb-3224-4deb-8667-bd627898820a~sc_324.232"]},
{"title": "Hotel Chelsea", "description": "Hotel Chelsea, built in 1884, stands the test of time. The landmarked building once a famed refuge for rare individuals, such as Andy Warhol and Janis Joplin, now emerges from rehabilitation. The rich history that’s undoubtedly made Hotel Chelsea iconic, evolves into a new chapter, as its story continues. \n\nWithin its grand exterior is several distinct event spaces suitable for any type of gathering, from intimate dinner parties to luxe weddings. The Bard Room, named for former owner and manager Stanely Bard, is a grand ballroom with historic architectural characteristics and antique brass chandeliers, is ideal for larger celebrations. Any gathering will be infused with glamour in this sophisticated setting. El Quijote, a more intimate version of the original restaurant with many of the original 1930’s details restored, is a cozy environment perfect for intimate dinners to whole restaurant buyouts. Cervantes, our wine room, with a sultry atmosphere is available for private dining. The Tea Room, set inside the original General Manager's office, features the original ceiling mural and molding, is perfect for private dinners or daytime meetings. Within the Lobby Bar, a grand European-style space that serves as a “living room” for the hotel, lies the Piano Room. Featuring custom furniture, ornate rugs, sun-filled Solarium and a Baby Grand Piano, it makes the perfect setting for the classiest of cocktail parties. Café Chelsea is an entirely new all-day restaurant within the storied hotel. The French American bistro has strong Provençal influences and will feature a private dining room with its own bar.\n\nThe hotel was redesigned by Sean MacPherson, Ira Drukier & Richard Born, with the aim to refresh the interiors while keeping the original spirit of the hotel. The food and beverage for each space and concept is thoughtfully curated to create a uniquely elevated dining experience is operated by Sunday Hospitality and partner Charles Seich. Sunday Hospitality is also the team behind: Sunday in Brooklyn, Sunday in London and Rule of Thirds. Taking this care to all aspects of dining, this is not your typical event food. The show-stopping presentation and flavors will be sure to wow your guests and create a lasting impression of a fabulous fête. Hotel Chelsea welcomes you to host an event that is sure to be as iconic as its history.", "rating": "5", "number": "(212) 483-1010", "location": "222 W 23rd St, New York, NY", "photos": ["https://media-api.xogrp.com/images/adfc38e7-8231-4d6f-9608-ea8b53942e4f~sc_324.480", "https://media-api.xogrp.com/images/4622c965-bdf2-4612-8511-81d888a64648~sc_324.480", "https://media-api.xogrp.com/images/04ccf17d-97e0-4f4e-bbbd-e86166f20e07~sc_324.232", "https://media-api.xogrp.com/images/cbba1bf9-a584-443f-b159-6dcb66f4f01d~sc_324.232"]},
{"title": "ASPIRE at One World Observatory", "description": "Aspire at One World Observatory is a contemporary wedding venue in New York, NY. Envision celebrating your dream wedding day at the top of the tallest building in the Western Hemisphere. \n\nSituated on the 102nd floor of One World Trade, this venue boasts 50 miles of visibility in each direction. This modern venue showcases breathtaking views of Manhattan and the surrounding boroughs. The 9,000-square-foot floor plan allows you to design a layout that is truly your own. It also provides the ideal contemporary and minimalist backdrop for your wedding photos. This expansive space is suitable for intimate and more extravagant parties, accommodating up to 175 guests. \n\nThe committed event team at Aspire understands how complex wedding planning can be and will be with you every step of the way. With different packages available, their service is completely personalized and tailored to your needs. Aspire offers world-class wedding entertainment and has curated a list of experienced vendors for your consideration. These professionals provide an unrivaled culinary experience with expertise in the finest classic cuisine and the latest food trends. Menu tasting is offered, and all dishes are presented with impeccable attention to detail. For a sophisticated dining experience, white glove table service is also available. This venue provides a prosecco welcome for your guests, cocktail hour, seated dinner with wine service, and a premium open bar. The magnificent views will undoubtedly leave a long-lasting impression on your guests. Celebrate your unique love story in a stylish and glamorous setting at Aspire at One World Observatory!", "rating": "5", "number": "(212) 602-4090", "location": "285 Fulton Street, New York, NY", "photos": ["https://media-api.xogrp.com/images/4bb6b5bf-3cf6-4d4e-b19c-4a414ca3d4bc~sc_324.480", "https://media-api.xogrp.com/images/704b5c4e-aea5-4d57-a5f0-cd8250d0539b~sc_324.232", "https://media-api.xogrp.com/images/31d18f13-d8b3-4520-8ac7-75b82ab58e90~sc_324.232"]},
{"title": "Pauls on Times Square", "description": "Have Your dream wedding in Times Square with a celebrity chef:  Say \"I do\" in the neon heart of NYC. Exchange vows and party in the Times Square's magic! Paul's on Times Square offers a magical one-stop wedding experience.  Begin an epicurean wedding adventure under the guidance of Chef Dino Redzic, the visionary luminary who formerly steered the prestigious James Beard Foundation and collaborated with Joseph Baum of the legendary establishments, the Rainbow Room and Windows on the World.\n\nAs an acclaimed culinary maestro and award-winning celebrity chef, Chef Redzic is dedicated to crafting an unforgettable menu tailored to your wedding celebration. Choose to revel in the tantalizing flavors of Chef Redzic's exceptional Italian cuisine, and experience firsthand the culinary magic that has captivated hearts around the globe. Join us as we transform your special day into an extraordinary culinary experience, where every dish reflects the passion and artistry of a true master of the craft.\n\nVenue: Our flexible event spaces are designed to make your dream wedding a reality, accommodating up to 120 guests. Whether you prefer our venue or have a specific location in mind, we're here to cater to your needs. We offer the option to host your event with us, or if you have another venue in mind, we can provide our exceptional catering services. Your options are limitless - choose the venue that speaks to you, and let us take care of the delicious food.\nFoodie Culinary Delights: Our chefs craft delectable Italian classics or gourmet creations to suit your style and budget.  Imagine your wedding menu orchestrated by a celebrity chef! Having a culinary star as your executive chef takes your wedding feast to the next level.\n\nUnforgettable Ambiance:\nEnvision a warm, elegant venue boasting panoramic views of Times Square for your ceremony and reception. Fulfill your bucket list dream of witnessing the iconic ball drop.  Enjoy an unobstructed view of the ball on New Year's Eve from our outside terrace, making it the perfect spot to fully experience this iconic moment.  \n\nPersonalized Experience: Our dedicated team caters to your every wish, creating a wedding that reflects your love story.\n\nEffortless Planning: Relax and let us handle everything, from flawless catering to expert coordination.\nFocus on Your Love: With Paul's on Times Square, you can simply enjoy your special day.\nContact us today to create your dream wedding!", "rating": "5", "number": "(212) 204-7246", "location": "136 W 42nd St, New York, NY | New York, New Jersey, Ct. MA", "photos": ["https://media-api.xogrp.com/images/07e2561a-e6a1-42c9-8e79-67d2464dbcc2~sc_324.480", "https://media-api.xogrp.com/images/63d0de9c-709c-4e1c-bb7d-5ef1e3603a98~sc_324.480", "https://media-api.xogrp.com/images/d6ed12e2-0893-4d3e-b316-201838c8ed1a~sc_324.232"]},
{"title": "The St Regis Hotel", "description": "With over 13,000 square feet of space in 15 venues, there’s a room for any gathering. The largest space accommodates up to 200. Vaulted, cloud-dappled ceilings hung with gilt chandeliers set the right tone for corporate and social affairs. Nestled in the middle of midtown Manhattan, the elegant St. Regis New York is a storied destination boasting legendary service, custom amenities, and internationally renowned venues and restaurants.", "rating": "5", "number": "(212) 339-6721", "location": "2 E 55th St at 5th Ave, New York, NY", "photos": ["https://media-api.xogrp.com/images/de46267a-3bb4-4460-ac78-099b0d0c75d4~sc_324.480", "https://media-api.xogrp.com/images/8f74343d-afe9-4f33-83a8-fdea1d46f7c5~sc_324.480", "https://media-api.xogrp.com/images/19adc227-fdda-49bd-8c17-f4bb53dc40f6~sc_324.232", "https://media-api.xogrp.com/images/3c1824cc-5b35-40bc-8810-7869d2ef29ef~sc_324.232"]},
{"title": "Pendry Manhattan West", "description": "Located in the vibrant heart of New York City, Pendry Manhattan West offers a luxurious escape with a Californian twist. The hotel seamlessly blends sophistication with comfort, providing guests with personalized luxury services and amenities. Drawing inspiration from the city's dynamic energy, Pendry Manhattan West boasts airy interiors and a striking signature façade, creating an atmosphere of understated elegance.\n\nEach guestroom reflects a contemporary take on timeless style, inviting guests to experience the cool character of New York's West Side. From morning coffee to evening cocktails, the hotel's culinary offerings, including Vista Lounge, Bar Pendry, Zou Zou’s, and Chez Zou, ensure a stylish and memorable dining experience.\n\nAs an anchor in the iconic Manhattan West neighborhood, Pendry Manhattan West offers easy access to the city's best dining, shopping, and cultural attractions. Whether it's a dream wedding, intimate gathering, or corporate event, Pendry's personalized service and attention to detail ensure every occasion is celebrated in style. The hotel features a variety of event spaces, including two distinctive ballrooms on the fifth floor, ideal for larger-scale events, and a gallery space suited for intimate celebrations. The Salon & Terrace's indoor and outdoor areas and elegant marble bar provide a stunning setting for rehearsal dinners and cocktail hours. With world-class interiors, exemplary service, and wonderful amenities, Pendry Manhattan West sets the stage for unforgettable moments in the city's heart.", "rating": null, "number": "(212) 933-7000", "location": "438 W 33rd St, New York, NY", "photos": ["https://media-api.xogrp.com/images/059f86cb-3348-4e9d-8c50-92d93fc93ad1~sc_324.480", "https://media-api.xogrp.com/images/bdf1d3ce-2312-467e-9fb9-d165615b2361~sc_324.480", "https://media-api.xogrp.com/images/dce7843b-63bc-4544-8377-1ae348c08185~sc_324.232", "https://media-api.xogrp.com/images/54053946-9814-4acb-96f0-7240c11aa788~sc_324.232"]},
{"title": "Carnegie Hall", "description": "The idea of Carnegie Hall was born in the spring of 1887 during the honeymoon of Andrew Carnegie and Louise Whitfield. While on their transatlantic steamship voyage to Scotland, a friendship developed with Walter Damrosch—a leading conductor and musical director of the age—who dreamt of a new concert hall in New York City. The Hall opened four years later in 1891 and has been home to more than a century of meaningful moments in its vibrant history. And now, your lifelong duet can premiere at Carnegie Hall.\n\nJust two blocks south of Central Park, the historic landmark is conveniently situated in the theater district of Manhattan and is the ideal setting for a magical wedding. The Weill Terrace Room, May Room, and Weill Music Room are private, thoughtfully designed, bright, flexible spaces adjacent to an expansive, landscaped rooftop terrace with a view of Central Park and the surrounding skyline. Historical touches and modern finishes combine for a harmonious mix of old and new.\n\nConstellation Culinary Group offers an innovative approach to delivering inventive cuisine, imaginative presentation, and unparalleled service. Every wedding menu is customized to ensure a memorable experience that fulfills each couple’s vision.\n\nSeasonal pricing and package rates are available. A maximum guest count of 200 can be accommodated.", "rating": "5", "number": "(212) 903-9647", "location": "881 Seventh Avenue, New York City, NY", "photos": ["https://media-api.xogrp.com/images/ebc6b756-014f-4015-acba-305910f8043d~sc_324.480", "https://media-api.xogrp.com/images/a6dd9d9f-cef0-42bf-b69a-214507c46181~sc_324.480", "https://media-api.xogrp.com/images/52f1efda-5ec7-461f-97fc-1ba599da811e~sc_324.232"]},
{"title": "Ravel Events at The Ravel Hotel", "description": "Located in the heart of Long Island City, NY, The Ravel Hotel stands as a beacon of luxury and elegance. Spanning ten floors, our hotel is intricately designed with rooms and event spaces that serve as perfect canvases for any event, making every moment special. We pride ourselves on our ability to seamlessly blend into your vision, ensuring everything unfolds according to your wishes.\n\nOur spaces are diverse to cater to every occasion. The Grand Ballroom, nestled on the first floor, comfortably accommodates up to 350 guests, and is detailed with a decor that epitomizes sophistication. Adjacently, our outdoor terrace provides an uninterrupted, breathtaking panorama of the Manhattan skyline. For events like cocktail hours, rehearsals, or intimate receptions, The Foyer is an excellent choice, with space for 250 standing guests and grand windows offering expansive city views. Those looking to elevate their celebration can opt for the Ravel Rooftop. Crowning our hotel, it offers mesmerizing views of Manhattan. Designed meticulously with a retractable roof and elegant furnishings, it's spacious enough for 400 standing guests. Moreover, our exclusive penthouse rooftop venue is the cherry on top, providing a sublime backdrop of New York's skyline for up to 250 guests.\n\nAt The Ravel Hotel, our commitment is to excellence. We offer comprehensive packages, ensuring every facet of your event is catered to. From dedicated bartenders and servers to top-notch DJs and photographers, our team is dedicated to ensuring that your event is nothing short of perfection.", "rating": "4.7", "number": "(718) 289-6118", "location": "8-08 Queens Plaza South, Long Island City, NY", "photos": ["https://media-api.xogrp.com/images/b4695023-5378-4fc9-9e82-ef5201bf69aa~sc_324.480", "https://media-api.xogrp.com/images/8c8e5e1a-7bd6-422e-8030-35dc653c8dc2~sc_324.480", "https://media-api.xogrp.com/images/8643711b-c543-490f-8286-67c29a70a4ca~sc_324.232", "https://media-api.xogrp.com/images/0602c18f-39d1-45f1-aa9e-241bd467c6fc~sc_324.232"]},
{"title": "Manhatta", "description": "Manhatta is a high-rise wedding venue, embodying the spirit of New York from 60 stories in the air. This flexible space is an ideal location for your wedding celebration, with magnificent views of Manhattan from the floor-to-ceiling windows. Perched high in the sky, you and your guests can revel in the festivities in complete privacy. \n\nWhen you book your wedding at Manhatta you will be spoiled for choice when it comes to reception spaces. The Whitman Ballroom is the largest space, with the capacity to host up to 200 guests for a seated banquet or 250 for a stand-up event. The crystal clear wrap-around windows provide a picture-perfect backdrop for the celebration. The space is fully flexible and can be decorated in your own style so you can see your vision come to life. You will have full views of many New York landmarks, including the Hudson River and the bay. The Bay Room Lounge can accommodate up to 150 guests and has a sleek, modern finish. Guests will be treated to stunning views of Lady Liberty and the Harbour. The Roebling Room is perfect for a more intimate gathering, and the restaurant can also be rented for the day.  \n\nThis flexible venue is available for all manner of events, including ceremonies and elopements, as well as corporate events. It is fully wheelchair accessible, and the staff are on hand to assist you throughout the celebrations. The catering menu features an array of different tastes and cultures, with foods from both the land and sea. The bar staff are also fully trained mixologists and will produce some mouthwatering cocktails. Celebrate in the sky with Manhatta.", "rating": "5", "number": "(212) 230-5788", "location": "28 Liberty St, 60th Floor, New York, NY", "photos": ["https://media-api.xogrp.com/images/1d55ea33-4b0c-42d6-94b0-fc75d3ed2926~sc_324.480", "https://media-api.xogrp.com/images/ceeaf9bf-3da0-4f3a-85f3-c78027e82fd4~sc_324.480", "https://media-api.xogrp.com/images/741647b6-7bdc-4ba2-b193-fbcb94988ba6~sc_324.232", "https://media-api.xogrp.com/images/6489fb22-9da1-495d-86b5-fdb66bdb32df~sc_324.232"]},
{"title": "Glasshouse Chelsea", "description": "GH Chelsea | Premier Wedding Venue in the Heart of NYC\n\nImagine exchanging vows against the iconic Manhattan skyline, with the glistening Hudson River at your feet. At GH Chelsea, your dream wedding becomes a breathtaking reality.\n\nThis high-rise gem in Chelsea offers two stunning floors with floor-to-ceiling windows, 200 square feet of terrace space, and architecturally acclaimed interiors with 11 to 14-foot ceilings that invite natural light and offer panoramic views that will leave your guests in awe.\n\nGH Chelsea exudes an elegant, contemporary ambiance, setting the perfect stage for your celebration. From ceremony to dancing, GH Chelsea covers all the steps of your wedding day.\n\nIt boasts an array of remarkable features:\n\n- Scenic Views: Panoramic city and river views create a mesmerizing backdrop for your event.\n- Outdoor Terrace: A spacious terrace for memorable outdoor ceremonies or receptions.\n- State-of-the-Art Technology: Built-in production infrastructure for seamless sound and lighting.\n- Luxurious Interiors: Floor-to-ceiling windows, elegant finishes, and flexible room configurations.\n- Flexible Layouts: Customized based on your needs and guest size.\n \n\nAt GH Chelsea, flexibility is key. Our team works closely with you to bring your unique vision to life, adapting our venue and services to your specific needs. From custom lighting to tailored floor plans, we ensure every detail aligns with your dream wedding.\n\nOur services cover everything you need:\n\n- Experienced Staff: From doormen to elevator attendants, our professional team ensures smooth operations.\n- Event Furniture: Stylish Bellini chairs, tables, high tables, and tufted stools to match your vision.\n- Audiovisual Equipment: In-house sound system, vibrant lighting, uplights, and a wireless microphone.\n- Beverage Packages: Premium packages with a variety of spirits.\n- Preferred Vendors: A curated selection of vendors to connect you to the best of the best to suits your needs.\n\nWe understand that your wedding day is a once-in-a-lifetime experience and GH Chelsea promises to make your wedding dreams come true.\n\nContact us today to learn more about how GH Chelsea can make your special day truly unforgettable.", "rating": "4.8", "number": "(212) 242-7865", "location": "545 West 25th street, new york, NY", "photos": ["https://media-api.xogrp.com/images/80324f13-9dd2-4899-9698-2205adddde7c~sc_324.480", "https://media-api.xogrp.com/images/ea9bcb21-772c-49f9-bf2d-6a49b15cddab~sc_324.232", "https://media-api.xogrp.com/images/dd6cdf5a-9fea-468f-8e79-a54ddb09e513~sc_324.232"]},
{"title": "Dear Irving on Hudson", "description": "Dear Irving on Hudson is the latest venue from Yves Jadot Restaurant Group, which is led by Yves Jadot and Alberto Benenati, with cocktails by Bar Director Meaghan Dorman. The group is behind New York City’s most romantic bars & lounge, the original Dear Irving and The Raines Law Room. Dear Irving on Hudson is located on the 40th and 41st floors with spectacular panoramic views of Manhattan. It offers Art Deco themed décor, sublime craft cocktails, elevated dining and outstanding service! Standing reception up to 150 people per floor (300 people total). \n\nTo request a proposal, copy/paste: \nhttps://yjrgroup.tripleseat.com/party_request/8951", "rating": "5", "number": null, "location": "310 West 40th Street, New York, NY", "photos": ["https://media-api.xogrp.com/images/595a21ac-6293-42b3-92c3-8f55ae74cd1b~sc_324.480", "https://media-api.xogrp.com/images/fb5c9dd1-7aa4-43a9-8f18-e7616229db88~sc_324.480", "https://media-api.xogrp.com/images/66f57d62-5514-43b6-b2af-12460dd76a8d~sc_324.232", "https://media-api.xogrp.com/images/ce392526-33c3-4b68-9813-3c2ef25af92a~sc_324.232"]},
{"title": "Above the Heights NYC", "description": "Above The Heights NYC is a wedding venue located in New York City, NY. This private event space boasts stunning amenities and gorgeous views that are ideal for a momentous celebration like your wedding. Here, you and your guests can experience the Big Apple from a breathtaking height, making memories that are sure to last a lifetime. \nAbove The Heights NYC lives up to its name. It is located in Upper Manhattan’s 23-story mixed-use tower, Radio 181. This rooftop property stretches across 13,000 square feet of space, giving you ample room to celebrate both your ceremony and reception. You can exchange your vows on the outdoor terrace, your service framed by stunning views of the George Washington Bridge. This open-air space can also serve as a setting for your cocktail reception, allowing you and your guests to take in the fresh air as you mix and mingle. The main event hall can be used to host your reception. This area is flooded with natural light, thanks to the generous windows, and can be set up for banquet dining for up to 300 guests. A dance floor can also be cleared following your meal, easily facilitating your evening’s entertainment. \nAbove The Heights NYC offers a number of different services to help your New York wedding be as magical as possible. These include a built-in bar for your event, catering kitchens, projectors, a surround sound system, and on-site parking. Outside vendors are welcome so that you can completely customize your event. You can also consult with the management team of the space and learn how you can use this venue to the best of its potential.", "rating": null, "number": "(212) 584-2305", "location": "2420 Amsterdam Avenue, 12th Floor, New York, NY", "photos": ["https://media-api.xogrp.com/images/34987bae-6679-4a1d-9c3c-70a1c08ce5df~sc_324.480", "https://media-api.xogrp.com/images/64e920a4-66da-48cb-a8b8-7cded59e61b7~sc_324.480", "https://media-api.xogrp.com/images/6f8b3d68-bfd6-4553-8aa5-2d0d51c72a02~sc_324.232", "https://media-api.xogrp.com/images/96c0a5e6-2556-4a4c-a8c6-75a236e7b95b~sc_324.232"]},
{"title": "Sterling Affair at The New York Academy of Medicine", "description": "Originally built in 1926, Sterling Affair at The New York Academy of Medicine is a historic wedding venue in New York, NY. Home to ultra-romantic backdrops, your happily ever after is guaranteed to be memorable should you choose to celebrate here. \n\nFor one, the Library Reading room makes for an ideal ceremonial site. Featuring bronze chandeliers, packed bookcases, large windows, wooden ceilings, marble busts, and chequered tiles, this well-lit space also overlooks central park. Needless to say, every nook and cranny is guaranteed to yield some fantastic clicks! The same space can also be configured to celebrate your reception and dance the night away. Furthermore, you and your wedding party can make use of the get-ready suite to prep in style and comfort. All in all, feel free to invite anywhere from 20 to 500 guests.  \n\nThe events team at Sterling Affair is committed to bringing to life the wedding of your dreams. To that effect, tables and chairs can be provided, alongside setup and cleanup services. AV systems are available upon request with which you can stream presentations. The in-house catering team can also work with you to design a menu that speaks to your tastes and preferences. Feel free to reach out for information about pricing and availability.", "rating": null, "number": "(212) 822-7229", "location": "1216 Fifth Avenue, New York, NY | Tri-State Area", "photos": ["https://media-api.xogrp.com/images/0620095f-8c52-44a4-832b-a23900bca77f~sc_324.480", "https://media-api.xogrp.com/images/062a7241-9002-4c38-b8ae-03710d837d89~sc_324.480", "https://media-api.xogrp.com/images/d0d0b2ab-3ac2-47c5-8186-4dfdccb9fb93~sc_324.232", "https://media-api.xogrp.com/images/9303a8e6-7f42-409e-a4fb-20c210b27b02~sc_324.232"]},
{"title": "NYC Water Cruises", "description": "BEST YACHT WEDDING IN NEW YORK\nNYC Water Cruises offers glamorous Hudson River trips, perfect for weddings, bachelorette parties, and other special events. Enjoy live music and fine wines while celebrating special moments with exceptional service & experience.\n\nALL INCLUSIVE BOAT WEDDING PACKAGES\nExperience stunning views of NYC's skyline, Liberty Island, and the Brooklyn Bridge from the ship's antique-style interior. NYC Water Cruises' expert team can personalize packages to cater the best service you need - from cocktails, six-course meal (including vegan options), and live entertainment by performers. Create lasting memories with NYC Water Cruises and plan your event with us.", "rating": null, "number": "(800) 273-5124", "location": "Pier 78, New York, NY", "photos": ["https://media-api.xogrp.com/images/52d92fcc-a0d1-4249-ad2a-65c5e7b4b2af~sc_324.480", "https://media-api.xogrp.com/images/60693c8f-2a70-4892-bc8e-92e2930d697c~sc_324.480", "https://media-api.xogrp.com/images/0f1b3596-badf-457c-8c8f-0accad51cbd2~sc_324.232", "https://media-api.xogrp.com/images/ee1a0650-4728-4371-9dd8-9dc08de1c659~sc_324.232"]},
{"title": "The Sanctuary", "description": "The Sanctuary is a beautiful and iconic wedding venue on the East River in New York City, NY. It includes more than 16,000 square feet of event space and affords spectacular views of Manhattan.\n\nFacilities and Capacity\n\nThe property has several magnificent event spaces. The Sanctuary was formerly a church near The Octagon, a historic octagonal building on Roosevelt Island, now on the National Register of Historic Places. Today, the Sanctuary's original stained glass windows and locally quarried granite combine with more modern features, including a sweeping 40-foot ceiling and 30-foot marble bar, to create an effect that's nothing short of marvelous. The Sanctuary opens onto a covered veranda, complete with lounge seating and an Instagram-ready mural of Roosevelt Island. Beyond this lies the 4,000-square-foot Terrace, a beautiful reception space that can seat over 250 guests. Other notable event areas include the lovely front-yard Patio, the tranquil VIP Courtyard, and the fully renovated three-bedroom stone House, which you can also use for your pre-wedding dinner and post-wedding brunch.\n\nServices Offered\n\nThe Sanctuary hosts engagement parties, wedding showers, elopements, ceremonies, and receptions. The venue has an in-house catering partner; outside caterers are also welcome, and there is a spacious prep area plus a custom wood-fired pizza oven and outdoor bar that your team is welcome to use. Other amenities include an indoor and outdoor sound system and event lighting. Tents and banquet furniture are also available for rental. Contact the team today to learn more about this one-of-a-kind New York City venue.", "rating": "4.4", "number": "(718) 300-1574", "location": "851 Main St, New York, NY", "photos": ["https://media-api.xogrp.com/images/f4953227-0f9d-4aec-a109-af0edae00f7b~sc_324.480", "https://media-api.xogrp.com/images/7c6ae44f-f87f-4549-8c91-80749d6f4502~sc_324.480", "https://media-api.xogrp.com/images/6fe9c45f-c1df-4dd1-8741-787eea55d53c~sc_324.232", "https://media-api.xogrp.com/images/4c6b86d8-c42f-4fd5-aa4b-011e055d45c4~sc_324.232"]},
{"title": "The Tippler", "description": "The Tippler is a wedding venue located in New York, NY. Celebrate your special day in a venue steeped in New York City's rich history and charm. The Tippler, situated beneath the iconic Chelsea Market, offers a unique and captivating setting for your wedding event.\n\nWhether you're planning an intimate ceremony or a grand celebration, The Tippler provides the perfect backdrop for your love story. Follow the glow of the \"OPEN\" marquee at 425 W 15th Street, and it will lead you underground to the intimate bar space. The interior is adorned with reclaimed water tower wood and train rails sourced from the nearby High Line. It’s also full of vintage library decor and has a distinctive speakeasy ambiance, exuding timelessness and urban chic. The Tippler can host semi-private cocktail parties for groups of between 20 and 60 guests. There’s also the option to host a fully private celebration with up to 200 guests. Elevate your wedding day with the unique charm and character of this venue, creating memories that will last a lifetime in the heart of New York City.\n\nAt The Tippler, their commitment to quality extends to the vast selection of artisanal spirits, beers, and wines, ensuring your guests enjoy an unforgettable experience. Their professional staff is there to ensure you and your loved ones are well taken care of. Savor innovative craft cocktails while surrounded by repurposed antique fixtures. Catering options come from market vendors and can be tailored to suit your taste and vision, whether you want to serve tacos, lobster, or doughnuts.", "rating": null, "number": "(917) 261-7949", "location": "425 West 15th Street, New York, NY | New York City", "photos": ["https://media-api.xogrp.com/images/167c7027-d4fb-43dd-a7c3-93a1c2563c48~sc_324.480", "https://media-api.xogrp.com/images/cfb662ff-ce94-474d-abd6-924457e3f5f2~sc_324.480", "https://media-api.xogrp.com/images/f42767ac-19a8-4f06-9168-4b3f5442bc47~sc_324.232", "https://media-api.xogrp.com/images/caaadc6d-10dd-4c39-9eec-a5dbd091f331~sc_324.232"]},
{"title": "Bronx Zoo - NY Zoos & Aquarium", "description": "Saying “I Do” at the Zoo provides a truly unique and unforgettable experience. Whether exchanging vows at the historic Zoo Center or sipping cocktails as sea lions look on, you and your guests will be inspired by exotic wildlife and architecture. Our spectacular indoor and outdoor venue provides the perfect setting for a one of a kind wedding, year-round. \n\n The Bronx Zoo is truly one of the most unique wedding venues available in New York. Imagine exchanging vows in a romantic ceremony outside among the free-roaming Indian peacocks. If you prefer an indoor ceremony, celebrate your nuptials inside the historic Zoo Center. Originally named the Elephant House when constructed in 1908, it was regarded as one of the finest and most modern zoological buildings, now serving as a beautiful and dramatic background to your ceremony.\n\nFor cocktail hour, guests can sip cocktails in the Madagascar exhibit alongside lemurs, Nile crocodiles, and other curious creatures, or mingle outside with the California sea lions. Cocktail hour is followed by dinner and dancing in Schiff Family Great Hall. This spacious 4,600 square foot hall, once home to our lions, was fully renovated and is New York’s first green & LEED-certified historic landmark building. Schiff Family Great Hall helps create your fairytale wedding with its timeless architecture and character. Along with the reception space, you and your guests will have private access to our Lion’s Patio and glass-enclosed bridal suite.\n\nThis unique experience has a maximum capacity of 175-guests for a plated meal and 250-guests for a cocktail-style event. Full wedding experiences range from approximately $280-$350 per person and include; ceremony, cocktail hour, dinner, open bar, and a wedding cake.\n\nAll event proceeds help support the Wildlife Conservation Society’s mission to help save wildlife and wild places around the globe.", "rating": "4.9", "number": "(718) 741-3836", "location": "2300 Southern Blvd, Bronx, NY", "photos": ["https://media-api.xogrp.com/images/5335347a-4c50-4475-8d73-03b29755e839~sc_324.480", "https://media-api.xogrp.com/images/ed4c811d-9b8b-4902-ac9b-c4bdf89d1ef9~sc_324.480", "https://media-api.xogrp.com/images/51efce06-6305-4aaf-8403-13c5530104c5~sc_324.232", "https://media-api.xogrp.com/images/43b188e5-d3ac-418f-aa9a-b10b66c4ba40~sc_324.232"]},
{"title": "The Malt House FiDi", "description": "The Malt House FiDi is a financial district tavern located in New York, NY. The building features over three levels with a spacious 7,000 square feet bar, making it perfect for larger weddings. Their mouthwatering burgers are ranked amongst New York City’s Best Burgers and are a treat with their wide variety of craft beers and cocktails. Imagine your big day in this high-ceiling bar, complete with wooden paneled walls, a glossy floor, and many open and private spaces for mingling with your loved ones. \n\nThis newly renovated craft beer and cocktail destination in the heart of New York’s Financial District offers a relaxing ambiance in its large quarters. You and your guests can explore the three floors of this building, whether you want to set up camp by the bar on the second floor or lounge comfortably with a whiskey and dear friend in the reclusive lounge on the third floor. The expert team of caterers source all of the food locally, allowing them to prepare your meal using the freshest produce and ingredients. \n\nThe team at The Malt House FiDi cordially invites you and your guests to an American-style reception in the opulent comfort of their dazzling tavern. Enjoy freshly prepared hearty meals, hopping ales, and catch-ups with your nearest and dearest. You can choose from their three-course prix-fixe menus, which can be served either as a traditional seated dinner or as a banquet-style meal. Reach out to the team for more information on their wedding and event services.", "rating": null, "number": "(646) 682-7577", "location": "9 Maiden Lane, New York, NY", "photos": ["https://media-api.xogrp.com/images/ec5ba0b1-4ed1-47d6-aa57-5d9914a1a9b6~sc_324.480", "https://media-api.xogrp.com/images/eb15970d-abde-4e2b-b2ed-e4a9d93a64fa~sc_324.480", "https://media-api.xogrp.com/images/6faee468-0a47-4cd9-be6c-434581942975~sc_324.232", "https://media-api.xogrp.com/images/72a600c4-deb6-407c-9037-51a31939fdd7~sc_324.232"]},
{"title": "Tribeca Rooftop", "description": "Tribeca Rooftop is a breathtaking wedding venue located in downtown New York City. This industrial setting is found in the trendy Tribeca area, off a charming cobblestone street. With views of Manhattan and the Hudson River, it offers an unforgettable setting for your milestone.\n\nTribeca Rooftop sits in an old printing press building from the 1920s. The team here is known for their attention to detail and commitment to making their clients happy. They want to help you have the day of your dreams and will go above and beyond to make it happen. They see their venue as a blank canvas, somewhere you can transform to bring your vision to life.\n\nWith 15,000 square feet of available event space, Tribeca Rooftop offers endless potential for wedding celebrations. Large windows fill the room with natural light, while high ceilings maintain a sense of airiness no matter how big the guest list. Up to 720 guests can be accommodated for a stylish cocktail hour, while ceremonies can have up to 325 attendees. You can exchange your vow on the rooftop terrace, using New York City as your backdrop. Inside, the event space includes a cherry wood dance floor that covers more than 1,000 square feet. The property also includes a get-ready room for the couple to use. On the day, an on-site coordinator can act as a point of contact for your vendors. Lounge furniture, tables, and Chiavari chairs are available from the venue. Catering is also taken care of by the team here. They offer seasonal menus that will delight guests and desserts from Duane Park Patisserie that you'll remember fondly for years to come.", "rating": "5", "number": "(212) 625-2600", "location": "2 Desbrosses St., New York, NY", "photos": ["https://media-api.xogrp.com/images/67f0369d-1aca-4079-91d4-1324616ad403~sc_324.480", "https://media-api.xogrp.com/images/ccb4b73c-9d70-47f7-9ab0-50d136462d0d~sc_324.480", "https://media-api.xogrp.com/images/99c2544f-d257-4407-bc16-b3042c92d8ef~sc_324.232", "https://media-api.xogrp.com/images/67a560fd-594a-4031-975c-5dca5c1e213b~sc_324.232"]},
{"title": "Hotel On Rivington", "description": "Situated in New York City, Hotel on Rivington is a wedding venue and hotel in a location with a rich history and cultural edge. It is on the Lower East Side and within steps of SoHo, Little Italy, Tribeca, and other lively neighborhoods. Both inside the hotel and out there is a palpable artistic energy that helps to make your wedding one to remember.\n\nHotel on Rivington has contemporary rooms that are made for comfort. In addition, you and your nearest and dearest can stay the night while being enveloped by some of the best that New York City has to offer. Hip restaurants that feature menus with an array of flavors are peppered throughout the surrounding streets. With so much to do and see you and your loved ones are sure to remain entertained before and after your wedding.\n\nA highlight event space at the Hotel on Rivington is the rooftop deck. Spanning 1000 square feet, you and your guests can gaze out toward the sweeping skylines of Manhattan. You may host your reception, cocktail hour, and more here. This space is a part of the Penthouse on Rivington, which in total boasts 3,500 square feet. The angular and sleek interiors with rows and rows of windows make this an elevated and awe-inspiring locale. For smaller gatherings, you can avail of the S’Zen Lounge, Cafe Medi, Terrace Suite, and more. Each of these spaces has its own charm, and take inspiration from Spain, Peru, Shanghai, and other global locations and cultures. This diversity extends to the cuisine, which includes dishes from the Meditteranean and France. Full bartending services are also provided and you may have a limited or open bar. Throughout the process of coordinating your special day, an event planner assists you while the staff at the hotel can help with setup and more.", "rating": null, "number": "(305) 606-8707", "location": "107 Rivington St, New York, NY", "photos": ["https://media-api.xogrp.com/images/52a059dd-2664-4f34-8227-c1143823bbda~sc_324.480", "https://media-api.xogrp.com/images/6d1f0b8e-a25b-41a6-991f-65912dcec09d~sc_324.480", "https://media-api.xogrp.com/images/17eacecb-57cc-4b05-a5fd-31ef03564836~sc_324.232", "https://media-api.xogrp.com/images/4d233c5f-f262-4747-8c14-b6262bafb863~sc_324.232"]},
{"title": "Tasca Restaurant", "description": "Tasca Restaurant is a wedding venue located in New York City. Founded by restauranteur Jay Espinal and his wife, Norisa, this lovely duo created a romantic and tranquil setting for people to enjoy authentic Latin-Caribbean cuisine. \n\nTasca Restaurant is a great gathering spot for all types of celebrations, including engagements, wedding rehearsals, receptions, and birthdays. Whether you want to bring your heritage into your big day or simply love the taste of these Latin dishes, this restaurant is ideal for you. With a capacity of up to 200 people, you can host large or intimate events in the property's downstairs lounge. The space features a cozy aesthetic with a fireplace, dark wood details, dim lighting, and a wine cellar. In addition, the venue is conveniently near many of the city's big attractions, such as Central Park, The Beacon Theater, and Lincoln Center, making the experience exciting for out-of-town guests.\n\nAt Tasca Restaurant, you can expect to find mouthwatering food and superb customer service. Their menu boasts a wide variety of delicious meals bursting with flavor. The chefs will work with you to ensure your chosen cuisine reflects your taste buds and dietary requirements. To accompany your meal, the in-house bartenders can craft specialty cocktails and pour the finest wines available. For more information, you can contact the team via their website or by phone.", "rating": null, "number": "+(121) 236-22211", "location": "505 Columbus Ave, New York, NY", "photos": ["https://media-api.xogrp.com/images/53879234-10c0-4b71-81c7-5c6809bff5a0~sc_324.480", "https://media-api.xogrp.com/images/0ca0f132-9436-4a34-94f8-7450f40bf15b~sc_324.480", "https://media-api.xogrp.com/images/64086515-b717-4d7c-8c09-9e042e33732c~sc_324.232", "https://media-api.xogrp.com/images/20df94a8-ad2e-4a8a-98a2-4a1646a3b885~sc_324.232"]},
{"title": "MyMoon Restaurant + Venue", "description": "A converted boiler room from Brooklyn's industrial past, MyMoon is a magical event venue in the heart of Williamsburg.  Since opening its doors in 2005, MyMoon has diligently worked to create memorable experiences for couples providing all-inclusive options not short on style in a stunning urban locale.  \nThe décor stays true to its industrial origins with vintage romantic touches.  MyMoon's spacious garden provides the backdrop for outdoor ceremonies, followed by cocktails in the courtyard, then dinner and dancing in the grand room.  Our team of wedding experts will guide you along the way to a night you'll always remember.", "rating": "4.9", "number": "(718) 599-7007", "location": "184 N. 10th St, Brooklyn, NY", "photos": ["https://media-api.xogrp.com/images/4b33790b-d7a7-484b-85ee-065ddca0cfcc~sc_324.480", "https://media-api.xogrp.com/images/b04366fb-ada9-4fd9-8647-703a991b0563~sc_324.232", "https://media-api.xogrp.com/images/5157c9a1-2372-4143-96fd-8163dc082daa~sc_324.232"]},
{"title": "The Foundry", "description": "The Foundry is a historically-rich wedding venue in Long Island City, NY. Originally used for manufacturing fine steel varnishes, this property has been carefully renovated to give couples a unique place to exchange their vows. Each event space at this picturesque setting boasts its own unique aesthetic, ranging from elegant to rustic.\n\nFirst built in the 19th century, The Foundry was actively operating until 1906, catering for the state’s riverfront needs. In 1980, the Du Val family carefully restored the building’s interior to celebrate its bygone era, and opened their doors to soon-to-be-weds in 2001. Visitors will now have multiple indoor and outdoor events spaces to enjoy their energy-filled celebration. The main space boasts an industrial chic atmosphere, with exposed brick surrounding the ground floor and mezzanine. Your ceremony altar can be placed in front of the large window for a lush view backdrop. Their courtyard offers brick walls covered in ivy that blooms during the spring and summer months. Up to 180 people can enjoy the views of the Queensboro Bridge from this breathtaking setting. For more intimate gathering, the Greenhouse offers weathered brick walls, a skylight ceiling, and year-round greenery. Cocktail hours can be hosted in either the elegant Albra Room, or the open-air Terrace, which both offer stunning views of the city.\n\nThe team behind The Foundry will connect you with their list of trusted vendors, from decor rentals to caters, to complete your nuptial vision. Your culinary team will have full access to the onsite industrial kitchen, which has plenty of preparation space to perfect your menu items. At least three staff members will be present on your big day, to answer your guests’ questions and ensure everything goes as smoothly as possible.", "rating": "4.9", "number": "(718) 786-7776", "location": "42-38 9th Street, Long Island City, NY", "photos": ["https://media-api.xogrp.com/images/cc1bbcc9-7ac8-4cfb-8195-87890f88dc41~sc_324.480", "https://media-api.xogrp.com/images/17a1f23b-82dc-4d5a-bae1-29d299aef18b~sc_324.232", "https://media-api.xogrp.com/images/ebbbd17c-1178-44f1-931a-ef9a100232af~sc_324.232"]},
{"title": "Hunt & Fish Club NYC", "description": "Hunt & Fish Club NYC is a fine dining restaurant that provides a sophisticated setting for your New York wedding celebrations. Whether you’re looking to host your reception or pre-wedding festivities, Hunt & Fish Club NYC has the space to bring your event to life.\n\nInside, this inspired space was designed to recreate 1960s New York. Acclaimed contemporary artist Roy Nachum teamed up with design and architecture firm Studio Iyor to create the atmosphere of a vintage-inspired steakhouse. Couples who choose to celebrate their love at this NYC establishment can enjoy the beautiful decor, which includes original artwork. Also of note is the more than 50,000 pounds of marble featured throughout, which creates a luxurious feel. There are several spaces within this venue for hosting your festivities. You and your up to 30 guests can enjoy a private, intimate dining experience in the oasis-themed Green Room, where the arched skylight and living green wall create a bright space with a beautiful backdrop. The glass-encased infinity wine cellar, called the Blue Room, hosts up to 100 individuals in a romantic setting. Finally, the White Room accommodates up to 250 for a full-scale reception with all of your loved ones. \n\nEach of the spaces throughout this venue can be arranged to offer you and your guests complete privacy. They can also be set up in multiple different formats, allowing you to customize each room to suit your needs, from elegant-sit down celebrations to cocktail receptions. For your meal, choose from a variety of delicious offerings, from swordfish and Maine lobster to bone-in New York strip and filet mignon. No matter what you select from the menu or how you choose to celebrate, rest assured that the experienced staff will create a luxurious experience to remember.", "rating": "5", "number": "+(134) 762-51220", "location": "125 W 44th St, New York, NY", "photos": ["https://media-api.xogrp.com/images/030f18eb-6c2e-45ee-831f-db232fba86ae~sc_324.480", "https://media-api.xogrp.com/images/50664ba4-a847-41a5-ae51-3d802bb46fae~sc_324.480", "https://media-api.xogrp.com/images/bb96159f-9c65-4df3-ba83-1b450f45bc14~sc_324.232", "https://media-api.xogrp.com/images/3a5b27ee-c22d-4e60-b59c-5e7f4347c60c~sc_324.232"]},
{"title": "160 Central Park West", "description": "160 Central Park West is a beautiful wedding venue in the heart of NYC, offering nearlyweds a breathtaking space to celebrate their milestone events. Just a stone's throw from Central Park, this historic chapel has been renovated over the years, bringing new life and excitement to its unique structure. With a modern touch, 160 Central Park West welcomes couples from near and far to host the wedding of their dreams. \n\nThis stunning venue takes pride in taking extra steps to reduce its carbon footprint. The in-house catering company, Purslane, strives to be a zero-waste, carbon-neutral business, setting a new standard for sustainability within the industry. \n\n160 Central Park West offers room for up to 400 guests within its church-style function space. With top-of-the-range audio, visual, and lighting technology, this beautifully designed space provides a canvas that can be decorated in accordance with your wedding theme and style. With its high ceilings and open floor plan, it also has plenty of room for ceremony seating or reception tables and chairs. There's ample street parking, too, giving out-of-town guests easy access to the property.", "rating": null, "number": "(120) 349-18353", "location": "160 Central Park West, New York, NY | NY, CT, NJ", "photos": ["https://media-api.xogrp.com/images/3c3a57e3-e5fd-41f8-aa81-6a38378ac844~sc_324.480", "https://media-api.xogrp.com/images/006c1f18-12dd-48ba-bc78-28dfbfcb5d52~sc_324.480", "https://media-api.xogrp.com/images/ec743b11-c75a-48f1-8d5c-43f8b77ed514~sc_324.232", "https://media-api.xogrp.com/images/2872c027-18d2-4d10-bdf9-8526d5210e0e~sc_324.232"]},
{"title": "The Pier Sixty Collection", "description": "Located within New York’s iconic Chelsea Piers, The Pier Sixty Collection offers three alluring waterfront venues — each with sweeping views — that are home to some of Manhattan’s most influential and notable events.\n\nWith a particular expertise in event management and execution, our team works alongside each client to provide a seamless event experience from start to finish. Our renowned culinary team lead by Executive Chef Matt Tiscornia provides seasonal and innovative menus and engaging presentations.\n\nTHE LIGHTHOUSE \nThe Lighthouse offers the sophisticated feel of a New York loft,  enriched with striking Hudson River views. Take in vistas of the Statue of Liberty, and the New Jersey skyline from the outdoor veranda or year round terrace, plus enjoy two private on-site suites for getting ready. With high ceilings and sleek hardwood floors, it’s a stunning canvas for customizing your perfect backdrop.\n\nCURRENT\nThe aptly named Current offers a truly modern venue overlooking the Hudson River and Chelsea Piers Marina. This innovative space combines unique design and textures for a clean wedding day canvas, with double-tier windows and custom LED ceiling lights only enhancing the ambiance. This unique venue would not be complete without its private suite, mezzanine level views, and outdoor veranda, ideal for warm weather cocktail hours.\n\nPIER SIXTY\nPier Sixty is one of New York’s most iconic event spaces, featuring floor-to-ceiling windows and an all-season terrace ideal for soaking in views of the Hudson River. This flexible, column-free space includes an outdoor veranda, private suites, and endless design opportunities to complement the view — and bring your vision to life.", "rating": "4.9", "number": "(212) 336-6060", "location": "Pier 60, Chelsea Piers, New York, NY", "photos": ["https://media-api.xogrp.com/images/01f081ad-36c6-4095-84f2-f95ea02ce116~sc_324.480", "https://media-api.xogrp.com/images/de5d03f8-e787-4be0-a6ad-8f0ac7971f6b~sc_324.232", "https://media-api.xogrp.com/images/8532dcd1-2c0c-450e-87ed-85544ce37a03~sc_324.232"]},
{"title": "Tribeca 360°", "description": "Located high above NYC’s trendy Tribeca neighborhood, Tribeca 360° is a loft-style venue for weddings and events. From the moment you step into this incredible property, you’ll know you’re in the heart of the Big Apple, as views of the city skyline are everywhere! Featuring large windows, modern interiors, and ambient lighting, Tribeca 360° is a truly sophisticated setting for your new beginning. \n\n\nWhen your guests arrive at the lower level of the Tribeca 360° building, they’ll be shown to a private elevator, their mode of transport to your wedding festivities. Once they reach the top floor, they can await you and your beloved’s arrival while admiring the stunning views of the city. With 17,000 square feet of interior event space on-site, you’ll have plenty of potential ceremony settings to choose from. Wherever you say “I do,” you’ll be surrounded by those who mean the most to you. After your ceremony,  you and your new spouse can snap those all-important wedding portraits on Tribeca 360°’s stunning rooftop, basking in the feeling of being “on top of the world.” Whether you envision a cocktail-style gathering or a glamorous seated banquet, this venue’s reception space can transform to fit your requirements. \n\n\nYour venue rental package will include access to a private dressing room on your wedding morning, a relaxing space where you and your loved ones can get aisle-ready! Tables, chairs, linens, and glassware will also be provided, creating the perfect blank canvas for your event decorators and florists to work with. An on-site events manager will be on hand to answer vendors’ questions and show them around the property so you can focus on enjoying your special day at Tribeca 360°.", "rating": "5", "number": "(212) 625-2600", "location": "10 Desbrosses St, New York, NY", "photos": ["https://media-api.xogrp.com/images/a8f59dcc-bc1b-4477-9d73-a91e36dc4dfc~sc_324.480", "https://media-api.xogrp.com/images/16547164-f8f1-4cb7-940c-a4347a5e004b~sc_324.480", "https://media-api.xogrp.com/images/952a33a8-793c-4500-aa43-2ada789fb31a~sc_324.232", "https://media-api.xogrp.com/images/bdad03de-2301-4d2d-b1de-10de0b63652c~sc_324.232"]},
{"title": "Hotel Eventi", "description": "Located in New York City, Hotel Eventi is a vibrant and stylish wedding venue. This hotel invites guests to dive into the energetic ambience that is found throughout its interiors. With a thoughtful design that expertly balances a sense of tranquility with liveliness, this hotel was established to help provide a memorable guest experience. \n\nHotel Eventi features floor-to-ceiling windows and outdoor terraces, allowing the urban vistas of New York City to serve as a backdrop to events. The hotel's ground floor takes up a block and has a living-room-inspired lobby, technological touches, and bars and restaurants. The interior design blends industrial elements with wood tones and warm fabrics, which the natural light illuminates. There are both outdoor spaces, along with settings indoors, like the 4,000-square-foot ballroom. This hotel can accommodate up to 350 people for cocktail receptions and 170 seated guests.\n\nThe professional staff at Hotel Eventi are eager to help you curate the wedding of your dreams. Their dedicated events manager can assist you with venue coordination, and the maître d' is available to ensure that the event goes smoothly the day of. This hotel's services also include a customized wedding cake and complimentary champagne toast, wedding-night accommodation for the couple, and access to a dressing room. Other services include catering by Laurent Tourondel, table-side wine service, room blocks, a dance floor, lounge furniture, tables, flatware, glassware, chairs, and more. The cuisine is complemented by the hotel's beverage selections, with coffee, tea, sparkling wine, imported and domestic beers, and other drinks available to serve at your wedding. The staff celebrates each couple's uniqueness and love story, pouring their talents into crafting a personalized event to reflect the nearly weds.", "rating": "4.9", "number": "(646) 794-6837", "location": "851 Avenue of the Americas, New York, NY | NY", "photos": ["https://media-api.xogrp.com/images/6119f880-1b91-48d8-930e-90d912716947~sc_324.480", "https://media-api.xogrp.com/images/8068e256-ad03-474e-a131-c224bc22cd78~sc_324.480", "https://media-api.xogrp.com/images/87764e38-2320-4367-8c8e-d5177edd322e~sc_324.232", "https://media-api.xogrp.com/images/04e5356f-d81c-4987-9053-ea5b8302ec19~sc_324.232"]},
{"title": "Glen Island Harbour Club", "description": "A truly spectacular place...surrounded by gently breaking waves, lush park grounds on a secluded island, breathtaking sunsets, a storybook chapel and dramatic views of the New York skyline bridges. Your guests will make a grand entrance across a drawbridge to the inviting lobby.", "rating": "4.9", "number": "(914) 636-6500", "location": "50 Glen Island Park, New Rochelle, NY", "photos": ["https://media-api.xogrp.com/images/95558430-6498-4561-80d9-8b333800168e~sc_324.480", "https://media-api.xogrp.com/images/f28af39d-4963-4e63-a89f-5f3914ad4c61~sc_324.480", "https://media-api.xogrp.com/images/35808160-3336-4f4f-a20a-786b9b329114~sc_324.232", "https://media-api.xogrp.com/images/65f26a45-0ff0-44a4-9105-7e19ac29f8a5~sc_324.232"]},
{"title": "Crossed Keys Estate", "description": "Crossed Keys Estate is a scenic wedding venue situated one hour outside of New York City in Andover, NJ. This lush property is nestled on 30+ acres of gardens, meadows, and old buildings that pay homage to its storied past. The estate house and stone cottage were originally built in the 1790s and now serve as retro backdrops for wedding portraits. Now featuring a new, state-of-the-art farmhouse, this venue perfectly blends quaint historic chairs with modern elegance and convenience. Brand new to the Estate is the Conservatory, a beautiful glass-enclosed building, that hosts the most magical cocktail hour! Crossed Keys Estate hosts weddings for 100 guests or more with a maximum of 275.\n\nAt Crossed Keys Estate you and your partner will exchange vows in a beautiful English garden surrounded by stone walls and leafy trees. Other seasonal gardens with hydrangeas and lilacs are also available for your exchange of vows. After tying the knot, you can wander over the verdant lawns to the Conservatory for cocktail hour and then the modern farmhouse for your reception dinner. This breathtaking building features a cavernous interior with vaulted ceilings, a wall of windows, exposed beams, and circular chandeliers that glitter from above. In addition, get-ready suites appointed with chic furnishings are provided for preparing with the wedding party.\n\nCrossed Keys Estate is family-owned and operated by the Rodriguez family, who strive to nurture a relaxing and stress-free environment for all couples. Since they purchased the estate in 1999 they have hosted more than 600 weddings on the property. Along with tables, chairs, glassware, china, and décor, rental of the facility also comes with a fire pit, a tree swing, and lawn games. In order to create a comprehensive experience, the venue even offers full-service gourmet catering and in-house floral arrangements from their experienced florist.", "rating": "4.9", "number": "(973) 786-6661", "location": "289 Pequest Road, Andover, NJ", "photos": ["https://media-api.xogrp.com/images/e9da5765-e305-4b49-8dca-78b456bdb8ca~sc_324.480", "https://media-api.xogrp.com/images/695d54b0-2eb6-42a1-91c9-47d5a0189cbb~sc_324.480", "https://media-api.xogrp.com/images/e1dc2a58-16a7-47d3-87e9-435c8e19b543~sc_324.232", "https://media-api.xogrp.com/images/913a7ceb-63e7-41cf-b2aa-c43964a51bfa~sc_324.232"]},
{"title": "Bear Brook Valley", "description": "Welcome to Bear Brook Valley, a serene wedding venue in northern New Jersey that provides you and your partner an inclusive, stress-free wedding experience. This wedding venue hosts only one wedding per day and has everything you need in one place-- private suites, four ceremony locations, cocktail hour, reception, and everything in between. Bear Brook Valley spans 80+ acres complete with a vineyard, waterfalls, and trails creating a picturesque setting for your celebration.\n\nInitially a golf club, the venue was completely redesigned for weddings in 2015 by Perry and Michele Bonadies. The owners have over 35 years of experience in the wedding industry and have transformed the entire location into the perfect wedding destination with a dedicated team of wedding professionals. You will have a wedding coordinator who will be with you from the day you tour the venue to the day of your wedding so that you can sit back and watch the magic unfolds.\n\nOn your wedding day, spend the morning in one of the suites with your wedding party.\nExchange vows in one of the four ceremony locations each, suitable for every season and style. Following the ceremony, your guests will head to cocktail hour which is just steps away. They'll be greeted with a top-shelf open bar, themed food stations from around the world, lite bites, and more. As cocktail hour starts to wind down and the energy begins to rise, you will make your way upstairs for the reception for dinner, dancing, and drinking.", "rating": "4.9", "number": "(973) 241-1001", "location": "23 Players Blvd, Newton, NJ", "photos": ["https://media-api.xogrp.com/images/50410e9b-24ac-4ec2-a30d-10731fe275e8~sc_324.480", "https://media-api.xogrp.com/images/fbf2690e-dfd8-4158-8ae1-2d3b8011ffe8~sc_324.480", "https://media-api.xogrp.com/images/987a547a-14f6-42fc-a199-7f8e2ad5cea1~sc_324.232", "https://media-api.xogrp.com/images/7973e4a6-15dc-4350-b72f-9efdb04d4926~sc_324.232"]},
{"title": "Lake Mohawk Country Club", "description": "Located in Sparta, NJ, just 50 miles outside of New York City, Lake Mohawk is a private lake community that features magnificent homes, a Swiss Alpine–styled village square, and an idealistic boardwalk which leads to a Swiss chalet–styled country club, beaches, and parks. \n\nThe country club, boardwalk, and beach are all centrally located on the beautifully landscaped property with breathtaking views of Lake Mohawk. Nestled into the colorful foothills of Northern New Jersey, a distinct warmth and unique atmosphere infuse all three venues, establishing the perfect setting for a wedding ceremony, reception, or rehearsal dinner. \n\nThe beach, located just off the boardwalk and steps away from the country club, makes for a perfect lakeside wedding ceremony, offering a picturesque backdrop and irresistible sunsets. If you would prefer, you can also exchange vows on our boardwalk, adorned with rustic lanterns and seasonal flowers. For winter weddings, we offer ceremonies in our spacious Grand Ballroom, with Palladian windows overlooking the magnificent Lake Mohawk. We invite you to come visit Lake Mohawk Country Club and see for yourself the irresistible romantic charm.", "rating": "4.9", "number": "(973) 729-6156 ext. 116", "location": "21 The Boardwalk, Sparta, NJ | Tri-State Area", "photos": ["https://media-api.xogrp.com/images/6d0b37f3-af1d-4142-89aa-c8ccac05e9b0~sc_324.480", "https://media-api.xogrp.com/images/5415d2dc-a66b-49ad-9463-db561bc46046~sc_324.480", "https://media-api.xogrp.com/images/21daeb56-a2fa-451f-97e7-dfb582c6f191~sc_324.232"]},
{"title": "OHEKA CASTLE Hotel & Estate", "description": "OHEKA CASTLE Hotel & Estate is a stunning estate fit for wedding events located in Huntington, NY. It holds a spectacular appeal to both the greater New York and Long Island areas. The majestic architecture that can be observed throughout the premises is reminiscent of elegant, French chateaux. These elements combined with dedicated services that go above and beyond, as well as a vibrant heritage, OHEKA CASTLE is poised to please most any guest. \n\nThis venue’s opulent history began in 1919. The 443-acre property was purchased by Otto Hermann Kahn, a prominent financier and philanthropist. Still withstanding, this estate maintains a claim to being the second-largest private residence ever built in the United States. During the Roaring Twenties, the home was used for grand parties and summer getaways. Following Kahn’s death in 1934, the castle was host to various entities before Gary Melius, a developer, bought and began restoring the property in 1984. With a panel of experts in his consort, Gary was able to refurbish the estate to its former glory, keeping authentic elements wherever possible. Nowadays, this breathtaking property is on the National Register of Historic Places and proudly holds a membership with national and international programs that recognize historic hotels. \n\nCouples and their guests can enjoy the lap of luxury at this castle. Weddings and events held at this property will be able to enjoy an event like no other. There are various different spaces to choose from for wedding occasions. Couples may take a tour of the estate to see all of the possibilities in person. The indoor areas include the Grand Ballroom, the Formal Dining Room, and the Terrace Room. Outdoors, there are four spaces, including lawns and gardens. \n\nHere, nothing is overlooked. Couples can feel confident that they will be taken care of during the entirety of their event. The castle’s staff offers catering menus that boast delicious entrees and delectable desserts. A selection of beverages is also presented, topped-off with exceptional service. Photos may be taken in a range of locations around the property. Should couples be interested in learning about available packages, they are encouraged to reach out to OHEKA CASTLE’s event team with inquiries.", "rating": "4.7", "number": "(631) 659-1400", "location": "135 West Gate Drive, Serving LI and NYC, NY", "photos": ["https://media-api.xogrp.com/images/3b8c4c92-64b1-4ad9-a691-04a67d859e30~sc_324.480", "https://media-api.xogrp.com/images/92a760dd-9fd5-403b-b4e8-5af8c91537f7~sc_324.480", "https://media-api.xogrp.com/images/4267a3db-0430-4103-bdd8-954257a97bc4~sc_324.232", "https://media-api.xogrp.com/images/44f7d87c-0acc-46b9-b49a-6e0f83e95408~sc_324.232"]},
{"title": "Whitby Castle at Rye Golf Club", "description": "Whitby Castle is a timeless wedding venue based in Westchester County in Rye, NY. This turn-of-the-century castle sits magnificently on 126 acres and boasts a striking resemblance to the original Whitby Abbey monastery in England. Thanks to its sensational views of Long Island Sound, perfectly manicured lawns, and golf course, the venue is the perfect backdrop for your wedding day photos. \n \nBuilt in 1852, the castle exhibits gothic and renaissance architectural design fused with a bright and contemporary indoor decor. The venue can hold up to 250 guests and have several options to choose from depending on the size of your party. Outside the castle, you may wed beneath the archway and continue your celebrations on the outdoor patio facing Milton Harbour. Inside, the venue holds a grand ballroom for receptions that is suitable for large groups. For more intimate gatherings, you can choose between two private reception rooms. \n \nThe team at Whitby Castle goes above and beyond to ensure that you and your guests are celebrated. They will be by your side every step of the way, making sure that everything runs seamlessly. The venue has a list of preferred vendors that you may choose from that can also simplify the decision-making process. There is an on-site restaurant available that offers catering options and full bar services. Further services available to you include event rentals like glassware, flatware, and linens, as well as valet and parking. When it comes to cuisine, you are in for a treat as there are multiple options available. Some of these include a champagne and bellini greeting, a cocktail hour, hors d’oeuvres, and a reception table with an exotic fruit, cheese, and fresh vegetable display. Some sample entrées also include free-range chicken breast, miso-glazed mahi-mahi, and New York strip steak with bordelaise sauce.", "rating": "4.9", "number": "(914) 777-2053 ext. 3153", "location": "330 Boston Post Road, Rye, NY", "photos": ["https://media-api.xogrp.com/images/8ed914a9-7051-4cd5-86b1-17311dfe5c55~sc_324.480", "https://media-api.xogrp.com/images/e4d62ef5-d2f8-46d8-8124-02b616600349~sc_324.232", "https://media-api.xogrp.com/images/1ca75bef-9ecc-48d6-bb09-6e8145d9e3fa~sc_324.232"]},
{"title": "Heritage Club at Bethpage", "description": "The Heritage Club at Bethpage is an elegant wedding venue in Farmingdale, NY. This country club features a variety of settings for you to host your big day, from the emerald green fields to the breathtaking reception halls. With the dedicated staff, mouthwatering menu, and luxurious amenities, you and your guests are sure to have an unforgettable evening.\n\nNestled on acres of rolling hills, The Heritage Club at Bethpage offers a private, secluded place for couples to get away from the bustling city life. The team is happy to host events of any size, from romantic elopements to receptions with over 500 guests. Their largest ballroom is the Conservatory, which offers 6,800 square feet of versatile floor space for you to design your dream day. Floor-to-ceiling windows surround the room to ensure you and your loved ones are never starved of the view. Elegant chandeliers hang above the refined hardwood floors, creating a welcoming, sophisticated atmosphere. Just outside the French doors are two terraces for you to enjoy receptions and cocktail hours under the stars.  The Lenox Room is a bright, airy event hall that can host ceremonies with up to 170 guests. The elegant fireplace and mantle make for a picturesque backdrop for you to exchange your vows. Many other event spaces, including the Tillinhast Bar or Heritage room, also make for romantic options.\n\nThe onsite team will customize their packages to best suit your needs and wants. They will connect you to their list of trusted vendors, including bands, florists, and decor services, to make sure everything matches your vision. In addition, the onsite culinary team will customize your menu to feature your favorite flavors, dishes, and desserts. From your engagement party to your grand exit from your reception, The Heritage Club staff will be ready to give you a one-of-a-kind celebration.", "rating": "5", "number": "(516) 927-8380", "location": "99 Quaker Meeting House Road, Farmingdale, NY", "photos": ["https://media-api.xogrp.com/images/fd4d20ef-2fd9-42bf-a3b9-8d064213f2e7~sc_324.480", "https://media-api.xogrp.com/images/f84cbadc-33b3-451f-b004-772edc006c8a~sc_324.480", "https://media-api.xogrp.com/images/5a785014-5b1e-4c18-a16c-0ac5e8a377be~sc_324.232", "https://media-api.xogrp.com/images/ee92f54e-407c-4aab-9b0f-5e941b2d74f5~sc_324.232"]},
{"title": "The Legacy Castle", "description": "The Legacy Castle is a wedding reception venue located in Pompton Plains, NJ. This sophisticated event space would be ideal for couples who want a fairytale experience on their special day. With beautiful indoor spaces and breathtaking outdoors, this gated property is a treat inside and out. Combine these features with dedicated staff and numerous services, and it certainly has a lot to offer.\n\nFirst purchased in 1998, this event space has been worked on for a number of years by Mounir Badaan. Inspired by late 19th-century architecture, The Legacy Castle offers a palatial setting that is more than worthy of one of life’s most important occasions. Landscaped grounds, royal touches, and refined splendor define much of the exterior. Entering through wrought-iron doors, there is even more to admire on the inside. Polished flooring, expansive spaces, and eye-catching chandeliers add a bright and upscale feel, creating a truly romantic setting for each big day.\n\nCouples can choose their favorite spot to tie the knot. Whether indoors or in the open air, clients can enjoy a truly one-of-a-kind space for starting the first chapter of married life. The Scenic Peninsula is situated by a lake in the shelter of tall trees; it offers a secluded and serene place for the magical moment. The Legacy Castle also features sublime ballrooms and other spaces that would be perfect for hosting the all-important reception or cocktail hour. Photo opportunities may be enjoyed around the grounds or inside the venue, and photographers are sure to appreciate the beautiful backdrops. Attentive staff, event planning, and mouthwatering cuisine are just a few of the impeccable services provided by this high-end venue.", "rating": "4.8", "number": "(973) 907-7750", "location": "141 Route 23 South, Pompton Plains, NJ", "photos": ["https://media-api.xogrp.com/images/2cd53338-2042-41c0-8d8c-64c345d0b773~sc_324.480", "https://media-api.xogrp.com/images/75722e76-0f77-4605-a2a4-f8b2196afd99~sc_324.480", "https://media-api.xogrp.com/images/0aa56745-6056-4714-b2fc-b46d62a2b9fa~sc_324.232", "https://media-api.xogrp.com/images/46a4395f-c9ac-4652-a48d-5e2eb67512a2~sc_324.232"]},
{"title": "The Crescent Beach Club", "description": "The Crescent Beach Club is a breathtaking venue, providing a destination wedding without ever leaving New York. With our beautiful white sand beach, the magnificent blue waters of the Long Island Sound, spectacular sunsets, and gourmet dining, The Crescent Beach Club provides a memorable once in a lifetime experience.\n\nImagine your ceremony on the beach in the most romantic background conceivable.  Envision walking down the aisle on our boardwalk in the sand, surrounded by beautiful blue water and palm trees - a backdrop that most couples only dream about. Then, the cocktail party with a steel drum calypso band playing the sounds of the Caribbean.  The reception follows in our grand ballroom, a room designed to accentuate the beauty of a waterfront affair. High ceilings and floor-to-ceiling windows overlook the beach where extraordinary sunsets are experienced nightly. When the dancing concludes, an after-party back down on the beach completes the evening, with an open bar, additional bar food, light music. Tiki torches and fire pits light up the night sky and guests chat about enjoying the best wedding they’ve ever attended.\n\nWe look forward to helping you plan your destination wedding!", "rating": "4.9", "number": "(516) 628-3000", "location": "333 Bayville Ave., Bayville, NY", "photos": ["https://media-api.xogrp.com/images/72b79c21-16bf-4171-aad6-8b8a36e7b4cc~sc_324.480", "https://media-api.xogrp.com/images/4703b677-a513-42e4-820a-970e20394b68~sc_324.480", "https://media-api.xogrp.com/images/d4641e37-59db-442e-ba66-3e31f18deb11~sc_324.232", "https://media-api.xogrp.com/images/3b832634-2f77-4766-a146-59586473e683~sc_324.232"]},
{"title": "The Mansion at Oyster Bay", "description": "Situated in Long Island, NY, The Mansion at Oyster Bay is a historic wedding venue brimming with luxury and refinement. Set against the backdrop of 120 acres of greenery, it combines timeless charm with stunning surroundings to create an unforgettable celebration. Complete with a full range of services to avail of, this beautiful country manor has everything a couple could need for an enchanting celebration.\n\nOriginally designed by renowned architects Delano and Aldrich, this stunning Gold Coast estate was constructed in 1918. Throughout the decades, it went through a number of owners and inhabitants, and is one of the few properties of its kind that still stands today. Many of the decorative elements have survived since the 1920s when they were added by the owner, art collector Alyssa Mellon Bruce. An avid traveler and socialite, Mellon Bruce hosted many Gatsby-style parties throughout the 1920s and ‘30s, and this atmosphere survives today.\n\nAn air of elegance and comfort exudes throughout the charming setting of The Mansion at Oyster Bay. Complete with enchanting ballrooms and exquisite furnishings, it invites guests to take a trip back in time to an era of sophistication and majesty. While retaining the refined atmosphere of days gone by, it has been updated with a host of modern conveniences to create a commodious ambience full of refined splendor.\n\nThe Mansion at Oyster Bay offers a dedicated service staff and a full range of amenities to cater to each couple’s unique wedding vision. Accommodating up to 350 wedding attendees, this stunning estate has a variety of spaces to choose from depending on guestlist requirements. Each couple is provided with an in-house planner to ensure that every need is met. Together they will help you create a comprehensive wedding timeline and arrange everything from to-do lists to seating plans. Couples are also invited to liaise with Lessings, the venue’s in-house caterers who have been providing fine dining to New Yorkers for over 125 years. They help each couple to create their own customized reception menu, featuring a variety of continental options as well as sports-bar fare. A comprehensive list of preferred vendors is also available including photographers, florists, and DJs. Whatever your wedding vision may be, this venue provides over a century of style and service to create an experience you and your guests will never forget.", "rating": "5", "number": "(516) 921-5707", "location": "1 South Woods Rd, Woodbury, NY", "photos": ["https://media-api.xogrp.com/images/7a97fa0f-3469-4bb8-9ec5-48be79a9375c~sc_324.480", "https://media-api.xogrp.com/images/dc747282-e338-45bc-bdee-7aea834fbd3b~sc_324.480", "https://media-api.xogrp.com/images/b879bf69-bfa3-4ef8-81c5-37cf493fbdc0~sc_324.232", "https://media-api.xogrp.com/images/b1e4810b-d22c-482e-b16f-5772971e329e~sc_324.232"]},
{"title": "Van Cortlandt Golf Lake House", "description": "The Lake House at Van Cortlandt Park Golf Course sets the stage for a very special occasion with a lake front view and one of the most historic Event Venues in New York. If you are looking for your next event location, you don’t have to look any further. Whether your event is an intimate cocktail reception or a formal affair, we will make sure that our space exceeds your expectations.\n\nThe Lake House is located in the North West corner of the Bronx, only several short miles from the border with Westchester County. The Lake House is so named because of its proximity to Van Cortlandt Lake. It has a 2,500+ sq. ft. outdoor deck with lovely views of the lake. Of course both the Lake House and the lake are located in Van Cortlandt Park.", "rating": "4.8", "number": "(718) 543-4595 ext. 3", "location": "Van Cortlandt Park S & Bailey Ave, Bronx, NY", "photos": ["https://media-api.xogrp.com/images/08012fcb-5168-4e57-8564-3be171a0b5e7~sc_324.480", "https://media-api.xogrp.com/images/5aea2cd3-4c83-45ee-94c7-af405cb52523~sc_324.480", "https://media-api.xogrp.com/images/30c867d2-9e36-48de-ac35-1f097c2a8ab7~sc_324.232", "https://media-api.xogrp.com/images/5a598e88-3bcb-48a0-b142-921db9934525~sc_324.232"]},
{"title": "Sunset Terrace at Chelsea Piers", "description": "Sunset Terrace at Chelsea Piers is an urban wedding venue located in New York City, NY. If you're seeking an intimate space to exchange your vows, this waterfront setting offers a breathtaking city skyline backdrop. The attentive staff will be there to oversee everything, making sure you and your guests are well looked after throughout the day.\n\nSunset Terrace at Chelsea Piers can accommodate events of various sizes, from romantic elopements to 150-person receptions. The main ballroom is located alongside the Hudson River, where passing sailboats and ocean liners bring a nautical element to the ambiance. The wraparound dock is made for one-of-a-kind photo sessions or ceremonies at sunset. In the interior, an industrial-style ceiling and light fixtures create the look and feel of a metropolitan loft. Floor-to-ceiling windows flood the space with natural light while offering panoramic views of the water. Flexible and spacious, the ballroom can be customized to suit your chosen seating arrangement. It is also accessible to the outdoor balcony where guests can chat together and soak up the scenery. \n\nA variety of services is available at Sunset Terrace at Chelsea Piers to ensure your wedding experience runs seamlessly. An event planner will work with you during your journey to the altar, matching each detail to your preferences. They can also offer all-inclusive packages that include catering, setup and cleanup, rentals, and more. Catering options include hors d'oeuvres, buffets, entrees, and desserts. To help you find your ideal culinary combination, you can arrange a tasting session before your big day.", "rating": "5", "number": "(212) 336-6777", "location": "Pier 62, New York, NY", "photos": ["https://media-api.xogrp.com/images/80b98ccc-34b6-46bd-b932-68cb1fd0bdd8~sc_324.480", "https://media-api.xogrp.com/images/5737fd9d-f5f4-4d8b-860d-d06c3c8ab918~sc_324.480", "https://media-api.xogrp.com/images/8b6cab9c-7e7c-4551-a504-1819068b1828~sc_324.232", "https://media-api.xogrp.com/images/4f4a2543-37c8-46c3-b1d5-cc9cb7e72f60~sc_324.232"]},
{"title": "Allegria Hotel", "description": "Allegria Hotel is an oceanfront wedding venue located in Long Beach, NY. The hotel offers striking backdrops of the Atlantic's rolling waves and endless skies for your big day. Between versatile event spaces and delicious gourmet cuisine, this unique hotel can accommodate all of the phases of your celebration. \n\nAllegria Hotel can host your wedding day in or more of their luxurious spaces. Jack's Rooftop is one of the hotel's most mesmerizing locations to exchange vows, sip cocktails, and dance under the stars. The rooftop is also ideal for photoshoots with your loved ones, as it's both breathtaking and private. Upstairs, you'll find a large infinity pool to enjoy before or after your event. Indoors, you can enjoy a mouthwatering meal in the Grand Ballroom. The ballroom consists of crystal-clean walls, white pillars, and stylish wooden floors to match. This space also offers ample room for your desired seating arrangement and elegant decor. \n\nBesides its eye-catching features, Allegria Hotel can make your event even better with seamless services. With a meticulous planner by your side, you can rest up and have every detail in place. This planner may provide catering services for your rehearsal dinner, cocktail hour, or reception. These services include plated meals and a large buffet. In addition to your wedding day, you may enjoy a night's stay in the establishment's private suites. These rooms vary from King Bedrooms with City views to Junior Suites with Oceanfront views. To experience an event that's easy and full of luxury, contact Allegria Hotel's team today.", "rating": "4.5", "number": "(516) 992-3765", "location": "80 West Broadway, Long Beach, NY", "photos": ["https://media-api.xogrp.com/images/a3fce51a-cf21-4b3a-a4fd-4d0a99d26319~sc_324.480", "https://media-api.xogrp.com/images/2f3b572d-ded6-4ab6-96b6-53d409d1ef74~sc_324.480", "https://media-api.xogrp.com/images/eef50d2e-a8c7-46bd-b464-a1f8a72aa721~sc_324.232", "https://media-api.xogrp.com/images/6d95266a-0615-4441-aaf5-ccb6544c2088~sc_324.232"]},
{"title": "The Glasshouse", "description": "The Glasshouse is a modern, light-filled wedding venue located in New York, NY. Newly completed in 2021, this brand-new venue makes for a sleek and elegant backdrop for your special day. Boasting a selection of event spaces for you to choose from, you are sure to find the perfect room that will blend in seamlessly with the theme of your special day. \n\nThe Glasshouse spans 75,000 square feet and can accommodate a minimum of 150 guests and a maximum of 1850. You are welcome to host both your ceremony and reception here, making for an ideal location for those looking for a one-stop-shop kind of venue. As well as stunning indoor event rooms, it also has two beautiful outdoor terraces that boast breathtaking views of Manhattan and the Hudson River. Unique light fixtures, high ceilings, and modern finishes can be found throughout the venue, as well as floor-to-ceiling windows that pool natural light into the building. The team welcomes you and your partner to prepare for your special day from the comfort of the luxurious get-ready suites, which feature plush seating and mirrors. \n\nThe Glasshouse team would be honored to help bring your vision to life. Wedding packages include chairs, glassware, and clean-up, so all you have to do is spend quality time with the people you love. The events team can help with planning and offering food and catering services that include service staff, bar rentals, and drinks. To help make the planning process that much easier, they have curated a list of preferred vendors who can help create the wedding of your dreams.", "rating": null, "number": "(212) 242-7800", "location": "660 12th Avenue, New York, NY", "photos": ["https://media-api.xogrp.com/images/20d9dbc3-1a54-47b7-bc78-2e2b47e121d4~sc_324.480", "https://media-api.xogrp.com/images/d45efcd8-517d-4b47-a134-6edc799b4afb~sc_324.480", "https://media-api.xogrp.com/images/6072f1d9-df2f-4ee9-943c-0a6c94dfe3c8~sc_324.232", "https://media-api.xogrp.com/images/05cc2320-e6e6-4629-94ac-7b8227b2a3d1~sc_324.232"]},
{"title": "The Factory 380", "description": "Nestled in the heart of New York, NY, the Factory 380 is an industrial-style venue ideal for hosting weddings and other special events. This artistic setting is inspired by Andy Warhol's iconic Factory, a congregation of artists like Mick Jagger, Bob Dylan, and Lou Reed. You can work closely with the expert staff to make your vision for your big day a reality.\n\nThe Factory 380 features eye-catching graffiti, exposed brick walls, and quirky plants, creating an unforgettable backdrop for any occasion. Throughout the space, you'll notice hints of Andy Warhol's famous art studio. Comfortable seating, neon signs, and sparkling disco balls create a lively atmosphere for your festivities. A full venue buyout can accommodate up to 300 people for your celebration. For more intimate gatherings, there are smaller private areas. A popular option amongst couples is Edie's speakeasy, named for Edie Sedgewick, an aspiring actress and model who frequently visited the factory. She was known for her unique style and famous yet controversial partnership with Warhol. \n\nDuring your celebration, the team at the Factory 380 can provide a variety of services to ensure that your event runs smoothly. Partygoers can enjoy mouthwatering cocktails made by expert bartenders. You can try tasty drinks like the fuego factory fuel, butterscotch espresso martini, the Taylor spritz, and boarding flight F380. Their food menu features delicious options like chimichurri steak tacos, buffalo chicken pizza, Thai satay bowl, braised birria burrito, and a chicken Ceaser crunch wrap. The Factory 380 would love to help you bring your celebration to life.", "rating": null, "number": "(131) 538-34797", "location": "New York, New York, NY", "photos": ["https://media-api.xogrp.com/images/ae8b1b74-35ab-4518-9791-c624503b0bb0~sc_324.480", "https://media-api.xogrp.com/images/adf70c27-7132-4d00-9cf4-cdfcf912f402~sc_324.480", "https://media-api.xogrp.com/images/6c015d53-269b-44e8-884c-56cec594c203~sc_324.232", "https://media-api.xogrp.com/images/a5fa3553-cd1d-4a76-be7a-23894bf322fc~sc_324.232"]},
{"title": "Central Park Wedding Ceremonies by Happenings", "description": "About\nParkwed offers an exceptional experience to celebrate your Central Park wedding. With over a decade of experience, we’ll ensure you have the perfect outdoor wedding amidst the timeless beauty of Central Park. \n\nVenues\nExperience romance and elegance with our Central Park wedding venues. From intimate ceremonies to large gatherings, we accommodate weddings of all sizes.\n\nWhy Parkwed?\nOur handpicked team of top-tier wedding professionals will handle every detail so you can relax and enjoy your special day. From wedding planners, to event coordinators, and on-site managers, we ensure your wedding will go according to plan.\n\nWe offer affordable packages that fit any budget without compromising on quality. You can customize your wedding ceremony to include flowers, music, photography, and many other details – say goodbye to wedding planning headaches!", "rating": "4.8", "number": "(332) 900-3898", "location": "Central Park West, New York, NY | Central Park, New York", "photos": ["https://media-api.xogrp.com/images/f7869795-a9f6-4fa0-ab9d-37faac9a9ceb~sc_324.480", "https://media-api.xogrp.com/images/8a727778-f98c-4451-bd6a-807e5d97a304~sc_324.480", "https://media-api.xogrp.com/images/eaee9961-b224-4cb3-886f-91ab457fced1~sc_324.232", "https://media-api.xogrp.com/images/41bc9471-f608-43ef-88f1-58ab6b6ed1be~sc_324.232"]},
{"title": "The Inn at New Hyde Park", "description": "The Inn at Hyde Park is a wedding venue located in Long Island, NY. This estate house was built in 1938 and retains all of its classic glamour to this day. The Inn offers several different settings for your Ceremony and Reception, allowing you to create a one-of-a-kind experience for your special day. \n\nThe Inn at Hyde Park allows you to celebrate both your Ceremony and Reception on site. There are multiple rooms you can hold your special service in.  From the Chapel to the Georgian Ballroom, Ceremonies of all sizes may be accommodated. The lush Gardens located in the back of the building may also suit your outdoor Ceremony needs, accompanied by our large Venetian gates, Koi pond and bridge for photos.  After your ceremony, guests may head up to the Tuscany Ballroom, which is inspired by an Italian market, complete with bistro chairs, umbrellas and a feel like no other event space.  \n\nThis building has rooms of every size to make your wedding dreams come to life.  From the boutique Gable Ballroom, which is timeless and classic, featuring marble floors and a grand fireplace with chandelier lighting, to the Georgian Ballroom, which is elegant and spacious complete with double doors, large mahogany bars and chandeliers, oak paneled dance floor, seating for over 350 guests.  Each ballroom comes with a bridal suite for you and your bridal party to relax in, on your special day.  These rooms are beautifully furnished and spacious enough to accommodate your entourage. Our trained and professional Bridal Attendants will attend to your every need. \n\nAlong with a beautiful setting, The Inn at Hyde Park offers a number of services to make your special day unforgettable. With a talented culinary team and our experienced Event Planners, your guests will be talking about the quality and level of service for years to come. With the help of the committed and professional Maître D’s and service focused Banquet team, you are sure to enjoy a magical celebration at this hidden New Hyde Park gem. \n\nYour rehearsal dinner may be held here as well in one of the many smaller and more intimate reception rooms throughout the building", "rating": "4.8", "number": "(516) 354-7797", "location": "214 Jericho Turnpike, New Hyde Park, NY", "photos": ["https://media-api.xogrp.com/images/f26aa1f1-9404-48fa-8acb-4b4a65b5f85d~sc_324.480", "https://media-api.xogrp.com/images/1b824485-991f-4072-9a67-72fc40ed5315~sc_324.232", "https://media-api.xogrp.com/images/d39fe3da-92b0-415c-bcbf-f5e1f97b7ada~sc_324.232"]},
{"title": "Westbury Manor", "description": "Congratulations!! We are happy to assist you in planning your special day.\nInquire about our winter thru spring 2025 discounted rates.\n\nBanquet office open daily, we look forward to seeing you.\n\nLocated in Westbury, NY, The Westbury Manor is an elegant mansion venue that hosts weddings and special events. Set on 5 acres of meticulously landscaped grounds, this property offers a truly spectacular backdrop for your special day. The property itself dates back to the early 1880s and boasts a rich and varied history. Now restored to reflect its authentic historic charm while providing modern amenities to guests, it offers an idyllic setting for special celebrations.\nThe Westbury Manor offers one wedding at a time. \n\nThe team at The Westbury Manor understands that every event is different. This property acts as a blank canvas for your nuptial vision, allowing you to design the weddings of your dreams. You will have free reign over the sweeping property, allowing you to create a celebration that suits your style. Whether you want to enjoy a ceremony on the grounds, or a reception in the historic mansion, this estate is all yours.\n\nThe Westbury Manor offers everything you need and more to create a flawless event. World-class chefs can provide catering for your banquet, using fresh, seasonal ingredients to create dishes that are full of flavor. This venue boasts a plethora of amenities for unforgettable entertainment, with dance floors and contemporary lighting. They can also provide a list of preferred DJ and entertainment vendors. Their package builder ensures that creating a customized event is easy and stress-free. This estate accepts ceremonies of all types, including religious and non-religious events, along with civil unions, commitment ceremonies, and elopements.\n\nPlease note the minimum guest guarantees for weekend weddings April thru December start at 100 guests.\n\nBe sure to check out the gallery for an exclusive 360° Virtual Tour!", "rating": "4.9", "number": "(516) 333-7117", "location": "1100 Jericho Turnpike, Westbury, NY | NY", "photos": ["https://media-api.xogrp.com/images/c9aaac62-0f50-4455-be9b-92399d9bec47~sc_324.480", "https://media-api.xogrp.com/images/7ceda5fc-ca94-491a-877b-9d9edfd19996~sc_324.232"]},
{"title": "The Ivory Peacock", "description": "The Ivory Peacock is a beautifully designed bar in the heart of Nomad in NYC. Furnished with old antiques from Europe, the bar's design creates a warm and welcoming ambiance for all guests. With a deep focus on world-class cocktails but not ignoring excellent wines and fresh draught beers, the Ivory Peacock caters to a wide demographic.\n\nWith three beautiful and unique event spaces to choose from, the venue is flexible. The Ivory Peacock can host your intimate wedding gathering or your more lavish grand affair. You and your guests will have ample space to enjoy the celebrations and dance the night away. The three distinct bars offer a variety of different areas for your guests to mingle, chat, and celebrate your love. \n\nThe food program is headed up by Executive Chef Grayson Altenberg, an alum of French Laundry. He loves to work closely with guests to ensure the food program is tailored to each guest's liking. Your menu will be completely personalized, and you and your guests will be taken on a culinary journey full of flavor and presented with care. The Ivory Peacock prides itself on its extensive drinks menu, which features over 800 different types of gin. Your occasion will be one to remember.\n\nThe Ivory Peacock is an elegant venue for weddings and other special events in New York, NY.", "rating": null, "number": "(191) 749-91202", "location": "38 W 26th St, New York, NY | New York, New Jersey, Conneticut", "photos": ["https://media-api.xogrp.com/images/194126b3-eb31-4ea3-8758-64717ef4c7ec~sc_324.480", "https://media-api.xogrp.com/images/8704f03a-25b0-4afb-9ac9-3b5d2f4fbfb2~sc_324.480", "https://media-api.xogrp.com/images/41f4b105-4b08-40cd-ad8b-f12eed78e347~sc_324.232", "https://media-api.xogrp.com/images/83a4b4b3-a3d7-46ec-b68e-72b756c57f37~sc_324.232"]},
{"title": "Blu on the Hudson", "description": "Blu on the Hudson is planning on opening their second floor event space in November 2024. \n\nOur wedding venue will offer a fine dining experience in Weehawken, NJ. Located on Lincoln Harbor, Blu on the Hudson provides couples with a stunning Manhattan backdrop for their wedding celebrations. Its proximity to New York City as well as JFK, LaGuardia, and Newark Liberty airports make it a convenient location for guests flying in from out of town. Near some of New York’s most visited destinations, from the Empire State Building to Times Square, this chic and modern venue provides a fantastic space for your celebrations and beyond.\n\nThe venue’s rooftop provides couples with 18,000 square feet of private event space with panoramic views of New York City’s iconic skyline. The greenery and water feature combine to create a relaxing environment for guests to mingle outside. To accommodate weddings throughout the seasons, the celebrations can also be held inside, where the Art Deco design, chandeliers, and large windows create a chic and sophisticated look and feel. \n\nAs much as this modern venue wows with its impeccable design, the award-winning food is equally memorable. The fantastic menu consists of the finest offerings from both land and sea. Enjoy sushi, sashimi, and more from the Blu Sushi Bar, while the dinner menu has a range of mouth-watering options, from Branzino to Wagyu Tomahawk steak. The signature cocktails and extensive wine list offer something for every guest on your list. With valet parking and plenty of hotels in the surrounding areas, the guest experience will be smooth from start to finish.", "rating": null, "number": "(201) 636-1200", "location": "1200 Harbor Blvd, Weehawken, NJ", "photos": ["https://media-api.xogrp.com/images/7f4b04bb-bad7-44b4-920f-2f01e9412153~sc_324.480", "https://media-api.xogrp.com/images/24197dbb-31c6-4746-8603-770f1934bef0~sc_324.480", "https://media-api.xogrp.com/images/07e8ba6b-eede-4cfe-8704-d6afc82b380f~sc_324.232", "https://media-api.xogrp.com/images/6a8abe7a-7c36-4153-8a14-8616d28e0479~sc_324.232"]},
{"title": "Yacht Events LLC.", "description": "Cornucopia Cruise Lines by Yacht Events LLC is a unique wedding venue based in Hoboken NJ & New York City, NY. Food and the exquisite execution of its service are our passion. We are a team of lifestyle and design experts producing legendary weddings and events for clientele for over two decades. Our team is professionally trained with some of the industry’s top leaders. Our unique and singular emphasis on “private dining” sets us apart from the crowd. Absent the daily distraction of restaurant/hotel service, our Executive Chef and his handpicked team are solely focused on crafting original menus and culinary experiences tailored to exceed your expectations and truly enhance your wedding day.\n\nWith a farm-to-table philosophy, our dining experiences are customized to your tastes and desires. Our culinary team eagerly awaits the opportunity to showcase an unforgettable event for you and your guests, drawing from the freshest local ingredients that our bountiful region has to offer, very often with a South Asian flair. While the core of our signature menu is Hudson Valley cuisine, our culinarians can produce menus of a much broader spectrum and delight in customizing menus that reflect your ideas and personal style. You can exchange vows on the deck overlooking the beautiful Hudson River, with the twinkling city lights as your backdrop. Each yacht in the fleet boasts streamlined interiors, generous entertaining space, and a built-in bar to serve you and your guests. \n\nBe it a multicultural Indian wedding for 1200, an intimate inter-faith celebration, or a special event blending two families, you can rest assured that you will find a team of open-minded, understanding planners at Yacht Events who will work closely with you to help realize the wedding of your dreams. Here you will receive a thoughtful boutique experience and design. We know that every couple is different, so we offer customized packages that will fit your needs. Please get in touch with us and learn more about how we can make your dream wedding a reality!", "rating": "5", "number": "(646) 801-2628", "location": "60 Chelsea Pier, 23rd St. & Hudson River Park, New York, NY", "photos": ["https://media-api.xogrp.com/images/4922ebbb-66cc-4934-8c19-d1f61eb06666~sc_324.480", "https://media-api.xogrp.com/images/b486085b-8d25-4558-889d-c953c294307a~sc_324.480", "https://media-api.xogrp.com/images/1c2bf761-aa22-44b0-9b18-cd8f750bd3c1~sc_324.232", "https://media-api.xogrp.com/images/7808814a-0803-4a03-8bad-7095018ad15c~sc_324.232"]},
{"title": "HollyHedge Estate", "description": "HollyHedge Estate is a historic wedding venue located in New Hope, PA. This stunning 18th-century mansion provides couples with a unique blend of timeless rustic charm and sophisticated elegance. From its fieldstone buildings to its traditional barn and the surrounding, serene countryside, guests are treated to magical views at every turn. Family-owned and operated, HollyHedge Estate has hosted countless celebrations, helping its guests mark several of life’s precious milestones.\n\nThe Luccaro family and their team of dedicated staff are honored to welcome nearly-weds to their home, bringing their dreams to life. Throughout the grounds of the estate, couples are welcome to choose from many event spaces for their ceremony and reception gatherings. For a romantic outdoor service, couples can exchange vows in the courtyard under sparking market lights surrounded by lush trees and an eye-catching water feature. The pond offers a private, picturesque spot for newlyweds to share a moment alone after the ceremony. The reception hall is a versatile space that provides couples with ample room for a formal dinner and an evening of celebration and dancing.\n\nThe dedicated event staff at HollyHedge Estate will work diligently to ensure that your wedding day runs smoothly. A wedding planner will work with you as you prepare for your day. Every element of your event is carefully considered and expertly executed. The in-house catering team can craft delectable dishes for you and your guests, providing you with an unforgettable culinary experience as you celebrate. To ensure all of your guests have easy access to the property, there is on-site parking, valet services, and wheelchair accessibility. The estate also offers overnight accommodation to out-of-town guests.", "rating": "4.8", "number": "(215) 862-3136 ext. 2", "location": "6987 UPPER YORK RD, NEW HOPE, PA", "photos": ["https://media-api.xogrp.com/images/e3723496-648c-443a-a3f7-2fade818d0ca~sc_324.480", "https://media-api.xogrp.com/images/2b58a7bc-0033-47c9-9378-d06957ad1d69~sc_324.232"]},
{"title": "North Shore House", "description": "North Shore House is a lakeside wedding venue located in Newton, NJ. Located right beside Swartswood Lake, this property offers a breathtaking backdrop for your ceremony altar. Whether you're planning an intimate elopement or extravagant reception with 200 guests, this setting will make your special day memorable.\n\nSurrounded by tranquil waters and lush forestry, North Shore House is ideal for couples wanting to retreat from the hustling and bustling city life. One of their main event spaces is the extensive patio on the peninsula. It's surrounded by manicured lawns and mature trees, adding natural beauty to your ceremony or open-air reception. The interior sports a rustic, welcoming aesthetic, with large windows, hardwood flooring, and vintage chandeliers. This manor also offers cozy accommodations for up to 30 people to enjoy a lovely wedding weekend. Separate get-ready suites are also available onsite, with personal assistants to help you prepare for the ceremony in luxury.\n\nNorth Shore House commits to only one couple each day to ensure that you have the entire venue to yourself on your special day. The team offers all-inclusive packages to make your planning process as stress-free and joyful as possible. They will make sure each detail of your event design, from your floral arrangements to your wedding cake, matches your vision. From your rehearsal dinner to your day-after brunch, the team will make sure that your nuptial weekend is full of love and relaxation.", "rating": "5", "number": "(973) 383-5460", "location": "912 Swartswood Rd., Newton, NJ", "photos": ["https://media-api.xogrp.com/images/a3a9b256-dc67-407e-b37e-177446a9c220~sc_324.480", "https://media-api.xogrp.com/images/d95affb4-eb51-480a-bbf1-f153e79f4b1d~sc_324.480", "https://media-api.xogrp.com/images/303f3e3d-33a4-4279-ab02-039649e0787c~sc_324.232", "https://media-api.xogrp.com/images/f8dd126d-7df6-48f7-a506-510e618264b7~sc_324.232"]},
{"title": "RGNY", "description": "Situated in the heart of Riverhead, NY, RGNY stands as a premier winery destination on Long Island's famed North Fork. Renowned for its award-winning wines and picturesque setting, our estate embodies elegance and charm. As a seven-day-open winery, we welcome wine enthusiasts, families, and couples seeking an idyllic backdrop for special occasions, including weddings, rehearsal dinners, showers, and more. Our commitment to excellence and the captivating vineyard ambiance ensure unforgettable experiences for all who visit.\n\nRGNY's estate offers versatile spaces accommodating up to 200 guests, providing an elegant backdrop for weddings and intimate gatherings. The venue radiates rustic charm amidst the picturesque North Fork landscape, offering indoor and outdoor settings for uniquely tailored events. Whether exchanging vows amidst the vineyards or celebrating in our charming event spaces, RGNY ensures an enchanting setting to elevate your cherished day.\n\nAt RGNY, the dedicated team orchestrates unforgettable celebrations. They curate personalized wedding packages in collaboration with seasoned local vendors, ensuring a seamless and memorable experience throughout. Couples can explore the estate through exclusive tours, indulge in wine tastings, and envisage their dream wedding against the captivating vineyard backdrop.", "rating": "5", "number": "(631) 298-0075 ext. 102", "location": "6025 Sound Ave, Riverhead, NY", "photos": ["https://media-api.xogrp.com/images/c4d2f2c8-7cad-40da-a7c2-fef8f54bf92f~sc_324.480", "https://media-api.xogrp.com/images/eb734513-364f-4d9e-a559-20dcf4b4c29d~sc_324.480", "https://media-api.xogrp.com/images/83910829-2ac4-42b9-8f26-a03108fb8d6b~sc_324.232", "https://media-api.xogrp.com/images/a69a1840-5cf4-454d-a4a3-b4db6f368fd5~sc_324.232"]},
{"title": "West Hills Country Club", "description": "West Hills Country Club is a golf club wedding venue located in Middletown, NY. Surrounded by luscious greens and the sparkling Wallkill River, this venue offers a private and calm atmosphere for your wedding celebration. The experienced staff strives to make your wedding day unforgettable by providing exceptional service in a luxurious location.\n\nUp to 500 wedding guests can be accommodated at West Hills Country Club. You can choose from two main event spaces to host your wedding celebration. The outdoor patio with a stylish gazebo is perfect for exchanging your vows. Surrounded by colorful gardens and leafy trees, this area offers a paradise setting for your special day. The covered marquee provides a bright and airy space for your wedding reception. Featuring elegant lighting fixtures and a spacious dance floor, this room is ideal for dining and dancing. Guests can also enjoy a stroll through the majestic grounds or play a round of golf on the exclusive course.\n\nWest Hills Country Club offers an extensive range of wedding-related services. The expert wedding planners can assist you with organizing your wedding celebration, by creating detailed timelines and seating arrangements. Chairs, linens, and rental items are all available to transform the event space to suit your style. The staff can take care of setting up and cleaning the area for your celebration. They are also happy to provide a list of recommended vendors, allowing you to find reputable services in the vicinity. The in-house catering team can prepare a selection of delicious food for you, including plated meals, hors d' oeuvres, and wedding cake. Guests can use the on-site shuttle and transportation services to get around the venue. Other services include valet parking, wheelchair-accessible facilities, and WiFi.", "rating": "5", "number": "(845) 341-1899", "location": "121 GOLF LINKS RD, MIDDLETOWN, NY", "photos": ["https://media-api.xogrp.com/images/3ed65add-604a-4780-bc03-75443352d7b2~sc_324.480", "https://media-api.xogrp.com/images/dcd26fc5-a189-479e-9201-0d20626c162a~sc_324.232", "https://media-api.xogrp.com/images/12f7bc2d-7e4c-427f-b3b1-2d6a0fac3584~sc_324.232"]},
{"title": "La Vibra NYC", "description": "Step into the lively ambiance of La Vibra NYC, nestled in the heart of NoMad, where the spirit of NYC intertwines with a vibrant atmosphere. This chic cocktail lounge and wedding venue exude the essence of \"the vibe,\" welcoming guests to enjoy innovative cocktails and a warm ambiance. Located in the vibrant Flatiron neighborhood, it's the perfect spot for intimate gatherings or celebrating love in style. Experience the energy and excitement of La Vibra NYC – where every moment is filled with unforgettable memories.\n\nLa Vibra NYC is a wedding venue located in New York, NY.", "rating": null, "number": "(171) 877-21861", "location": "37b west 26th street, New York, NY", "photos": ["https://media-api.xogrp.com/images/68ca5ecf-753f-4fca-b188-b5cc80171be5~sc_324.480", "https://media-api.xogrp.com/images/c9853849-ac58-471f-a44e-ed069c2370d8~sc_324.232", "https://media-api.xogrp.com/images/33c5b4af-ef17-43ba-8910-edb9bf635671~sc_324.232"]},
{"title": "Renault Winery", "description": "Renault Winery  is an elegant vineyard wedding venue located in Egg Harbor City, NJ. One of the oldest continuously operating vineyards in the United States, the property has been crafting fine wines for over 150 years. It has four gorgeous wedding venues to choose from that can accommodate both ceremonies and receptions. Packages start at $179 per guest.\n\nVineyard Ballroom & Courtyard\nChampagne Ballroom & Courtyard\nChâteau Renault Ballroom\nThe Pavilion\n\nSpanning 1400 acres, the resort transports couples and their guests to Europe with its sprawling vineyard and the beautiful Château Renault. This wedding destination has  event spaces that can accommodate up to 400 guests.  With so many venue options and amenities to choose from, this historic vineyard is sure to create lasting memories for couples and their loved ones.", "rating": "4.9", "number": "(609) 965-2111", "location": "72 North Bremen Ave, Egg Harbor City, NJ", "photos": ["https://media-api.xogrp.com/images/3c3d5af0-c585-4579-a7d2-4e5c027546ed~sc_324.480", "https://media-api.xogrp.com/images/05e87cea-58d9-49c4-9035-147e65cab37f~sc_324.232", "https://media-api.xogrp.com/images/2388f4e7-1858-4a61-864f-7bfa140246d2~sc_324.232"]},
{"title": "The Mezzanine By Liberty Church NYC", "description": "Welcome to The Mezzanine By Liberty Church NYC, a stylish wedding and event venue located at 55 Broadway in New York City's Financial District. \n\nIndustrial chic in design, the space boasts an impressive 6,300 square feet across four rooms. It offers a 300-standing/150-seated capacity, stunning floor-to-ceiling windows as well as versatile conference rooms, a sleek elevated seating/decor feature, a state-of-the-art kitchen, high-speed internet, and surround-sound audio for an unforgettable event experience.\n\nThis rare, highly sought-after raw space offers an incredible opportunity to design the event of your dreams. Upon booking, a custom floorplan creation meeting will present the vast selection of space configurations with designer lounge furniture that will serve your every event need. Our list of preferred and highly recommended event vendors will bring your wedding events to life.\n\nWe look forward to welcoming you to The Mezzanine at 55 Broadway for your special day.", "rating": "5", "number": "(121) 225-98221", "location": "New York, New York, New York, NY", "photos": ["https://media-api.xogrp.com/images/00a7cac1-1852-4edb-835d-7b754e7007fb~sc_324.480", "https://media-api.xogrp.com/images/aae531e7-52b3-44ea-8b8d-ebc77d788c62~sc_324.480", "https://media-api.xogrp.com/images/c21153bd-4f7f-498b-9b13-07488f12c30c~sc_324.232", "https://media-api.xogrp.com/images/1031645d-06d2-466f-bc9d-83502039d012~sc_324.232"]},
{"title": "Mezcali", "description": "Mezcali is a mezcal and tequila bar in New York City, offering a unique venue experience for weddings, rehearsal dinners, and other special events. This vibrant eatery is the brainchild of two best friends from Southern California, who grew up skateboarding, exploring the world around them, and eating the best Cali-Mex food together. They became inspired to bring a little of the Mexican Cantina experience to the heart of Manhattan, and so Mezcali was born. Today, the restaurant welcomes diners to its Financial District location, where an authentic. soulful, and memorable dining experience awaits. \n\nMezcali's décor is the definition of rustic meets modern, with bricked walls and luxury furnishings creating an ambiance of peace, relaxation, and connection. The restaurant's expansive dining area can easily accommodate events of all styles and guest lists, with buy-out options available for very large gatherings. Couples will work with the team to design a bespoke catering menu for their celebration, bringing the best of Cali-Mex cuisine to their guest's dinner plates. From delicious tacos to enchilada sharing platters, every dish is crafted to the highest standards of quality, taste, and flavor. \n\nAs a popular mezcal and tequila bar, Mezcali is one of the Financial District's premier destinations for incredible Mexican-inspired beverages. The restaurant's mixologists and bartenders are always happy to help guests find their perfect drink, introducing them to the sweet yet smoky taste of authentic mezcal. Custom cocktail menus are also available, allowing newlyweds to toast to the beginning of married life with their favorite Mezcali beverage.", "rating": null, "number": "(917) 409-5881", "location": "83 Maiden Lane, New York, NY", "photos": ["https://media-api.xogrp.com/images/a0652770-ba67-48f2-9bd6-9db50aea1216~sc_324.480", "https://media-api.xogrp.com/images/b6d46f5c-8dd4-4062-85f1-226a8ad4eca9~sc_324.480", "https://media-api.xogrp.com/images/63a6f47c-0172-4199-9c79-6098d734211a~sc_324.232", "https://media-api.xogrp.com/images/7bbc7720-9271-4018-b7c2-6273de787376~sc_324.232"]},
{"title": "The Grandview", "description": "Experience world-class service, modern elegance and unmatched views of the Hudson River where you and your guests are treated like family. Say \"I Do\" with the stunning Mid-Hudson Bridge as your backdrop in our two exclusive ceremony spaces, and be pampered in luxury throughout your day in our private wedding suites. Our all-inclusive wedding package allows you to personalize every aspect of your day with mouth-watering cuisine, luscious dessert options and so much more to create the wedding you've been dreaming of. \n\n\"I got married at the Grandview almost 3 weeks ago now and I’m still reeling from how amazing everything was. My husband and I each had multiple people tell us it was the best wedding they’d ever been to, and everything that was done for us was so meticulously thought out and special. If I had to do it all over again, I’d undoubtedly still choose the Grandview!\" - Alexis C\n\nYou and your guests will receive remarkable service from our hospitality team which includes your own Maître d', event coordinator, wedding attendant, and professional servers who'll go above and beyond to make your wedding run smoothly and stress-free.\n\nChoose from two extraordinary private spaces for your reception. A riverside Outdoor Ballroom with panoramic views, manicured gardens and a private wedding cottage or our newly renovated indoor Grand Ballroom, a spectacular space adorned with high ceilings, customizable up-lighting, French doors, and dramatic chandeliers.\n\nYou and your wedding party will be pampered throughout the day in our modern wedding suites. For outdoor weddings our new Wedding Cottage overlooks the outdoor ceremony area and outdoor ballroom and provides a secluded and tranquil setting for you to get ready or escape during your day. Our indoor wedding suites provide an abundance of space for your hair and makeup team to pamper you with full-length mirrors, oversized vanities, and a private bathroom.\n\nOur dedicated culinary team takes pride in crafting mouthwatering dishes and interactive food stations that will delight your guests. Your package also includes a custom wedding cake freshly baked in-house to your specifications. Let us help you design a menu that perfectly aligns with your vision and taste.\n\nWhen you choose The Grandview as your wedding venue, you can expect exceptional service and a luxurious experience from our entire team of professionals. We invite you to experience the beauty and elegance of The Grandview for yourself. Contact us today to schedule a tour and begin planning your perfect wedding day.", "rating": "5", "number": "(845) 486-4700", "location": "176 RINALDI BLVD, POUGHKEEPSIE, NY", "photos": ["https://media-api.xogrp.com/images/865753ea-dd94-43ee-a453-a2a70d4b4973~sc_324.480", "https://media-api.xogrp.com/images/9beeba9c-8b17-493f-8c86-ec79e95fc875~sc_324.480", "https://media-api.xogrp.com/images/bef6f82b-150f-4869-b60e-9830a3a78606~sc_324.232", "https://media-api.xogrp.com/images/cc91deb6-fedd-4fa6-b596-08a236488e95~sc_324.232"]},
{"title": "Bella Union Bar", "description": "Step back in time and infuse a dash of the Wild West into your wedding festivities. Picture this: your reception at Bella Union Bar in the heart of New York City. Imagine sipping on iconic American cocktails in a richly appointed saloon, all while taking in the stunning, contemporary views of the iconic Empire State Building and Chrysler Building. This is where dreams of a New York fairytale wedding come true.\n\nGet ready for a grand, old-school American saloon extravaganza in this centrally-located venue that's ideal for private parties of 20 or more. It's a celebration dream come true, with three distinctive floors to choose from. The crowning jewel is The Rooftop, offering splendid open-air views of iconic city landmarks, while filtered light pours through designated skylights, creating a warm and inviting ambiance. The rustic charm of brick walls, wooden bars, and tables adds an authentic touch to the decor. Moreover, this space is versatile, ensuring you and your loved ones can dine and celebrate comfortably regardless of the season. The Rooftop fully winterized for those colder months, and when summer calls again, retractable canopies open up to let in the sunshine. You can rent just the rooftop or go all out with an entire bar buyout of up to 3 floors, ensuring your celebration is truly unforgettable.\n\nThe team at Bella Union Bar warmly invites you to hold your special occasion in the luxurious comforts of their saloon. They have flexible event and catering packages that feature a variety of tiered open bar packages, cocktail style reception, food platters, seated dinners, and luncheons. Exciting menu options include smoked salmon and avocado bites, mac 'n' cheese cups, braised short rib, flatbreads and much more. The bartenders can work their magic into crafting some signature cocktails and a variety of craft beers and wine for you and your guests to enjoy throughout the night. Reach out to the team today for more information about this lively and stimulating venue in the beating heart of New York City!", "rating": null, "number": "+1(646) 627-7841", "location": "411 Third Avenue, New York, NY", "photos": ["https://media-api.xogrp.com/images/9da599dc-0387-4ce2-b188-449a40059ff1~sc_324.480", "https://media-api.xogrp.com/images/f2dac935-c6d3-4075-b625-244c6a5cfeca~sc_324.480", "https://media-api.xogrp.com/images/17723306-7ac0-45bb-a992-faa81ce19bc3~sc_324.232", "https://media-api.xogrp.com/images/adce0b19-0f61-4365-bf41-081a7d68c075~sc_324.232"]},
{"title": "Hard Rock Hotel New York", "description": "Your love takes center stage at Hard Rock Hotel New York. At the heart of music and entertainment with a vibe that cannot be replicated, our wedding venues in Manhattan are everything you want in a destination. \n\nTake to the sky at RT60, our Rooftop Bar with two outdoor terraces plus a VIP room ideal for showers, receptions, and more. Host your rehearsal dinner at NYY Steak and indulge your inner sports fan among Yankee memorabilia while dining on sustainably sourced cuisine. Welcome your loved ones upon arrival with a cocktail (or two) at Sessions as they immerse themselves in the soundtrack of the city. Be the star of the show with The Venue on Music Row, our extraordinary bi-level event space with capacity for up to 400 guests. Elevate your wedding to platinum level with the Rock Star Suite, the crown jewel of Hard Rock Hotel New York. The bi-level penthouse features original artwork and music memorabilia from New York greats. Immerse yourself in natural light from the double-height floor-to-ceiling windows or have the ceremony of your dreams high above the city on the 2,000 sq. ft. outdoor terrace. \n\nHard Rock Hotel New York has dedicated event planners to help create the wedding you have always wanted. The on-site culinary team will provide delicious cuisine for you and your guests to dig into. Additionally, the property has high-tech amenities, including WiFi and audio-visual capabilities.", "rating": null, "number": "(929) 766-9075", "location": "159 West 48th Street, New York, NY", "photos": ["https://media-api.xogrp.com/images/dc28ab13-a1da-4060-af26-dd19ad9f547c~sc_324.480", "https://media-api.xogrp.com/images/eeea905f-2ee6-4749-9d19-335d20663eaa~sc_324.232", "https://media-api.xogrp.com/images/eb0c1960-609d-433f-89e8-a3006f651c79~sc_324.232"]},
{"title": "Martinique New York on Broadway", "description": "Martinique New York is a breathtaking wedding venue in the heart of Midtown, NYC, near the Empire State Building and Macy’s Herald Square. This romantic site offers a dreamy location where couples are invited to host their fairytale wedding surrounded by their loved ones. This hotel boasts various function rooms to cater to the unique needs of the occasion. \n\nNearlyweds and their guests are welcomed into the stunning lobby, with ornate mansard roofs and hand-laid tile flooring. Classical crystal chandeliers illuminate the area with a warm glow, setting the tone for a glamorous celebration in line with the Roaring Twenties theme. The 18-story marble spiral staircase creates a remarkable backdrop for wedding photography before and after the ceremony. Martinique New York offers various-sized spaces to cater to any gathering, from intimate micro-weddings to grand affairs. The largest room covers over 3,700 square feet, providing a reception hall for 400 guests. This area is flooded with light from twinkling overhead chandeliers. The preserved architectural details of the building will delight any lover of design as this historical site boasts its connections to the French Renaissance with every curve and line along the walls.\n\nThe dedicated team at Martinique New York takes pride in offering an elite service to nearlyweds, allowing them to enjoy their coordination process knowing they are in the best hands. The in-house specialists strive to deliver an unforgettable experience from start to finish, ensuring the happy couple can dance their way through the event and enjoy every second. A range of culinary options is at the disposal of nearlyweds, from sandwiches or Korean BBQ to tempting donuts and lavish beef wellingtons. As the festivities draw to an end, newlyweds and their attendees can avail of the elegant hotel accommodation options for added convenience. These spacious suites and cozy guest rooms boast everything needed to enjoy a restful stay at Martinique New York. Guests can also avail of ample working space, a 24-hour fitness center, and modern amenities to elevate their weekend stay.", "rating": null, "number": "(212) 277-2646", "location": "49 W 32nd St., New York, NY | New York City, Manhattan", "photos": ["https://media-api.xogrp.com/images/0a54cfe3-c1ee-459c-90b9-0eb9a4b820e6~sc_324.480", "https://media-api.xogrp.com/images/fda9f850-c7a3-4281-b214-df4c7bffbda6~sc_324.480", "https://media-api.xogrp.com/images/f47ed2f2-f531-4044-901c-3aefc80ea734~sc_324.232", "https://media-api.xogrp.com/images/7120b1f1-971d-4245-aef9-9d7da0cbc57a~sc_324.232"]},
{"title": "Margaritaville Resort Times Square", "description": "Margaritaville Resort Times Square is a wedding venue located in the heart of Times Square in New York, NY. This unique hotel and event space offers a tropical getaway in the midst of the hustle and bustle of the big city. The iconic and cozy resort makes for a one-of-a-kind wedding experience that you and your partner will treasure forever. \n\nMargaritaville Resort Times Square offers world-class amenities for you and your loved ones to enjoy on your wedding weekend. Spend your days exploring the exciting attractions and historic sites of New York City, and then return to the comfort of this beach-themed resort. The hotel is designed to resemble a tropical paradise and its decorations and accents create a relaxing atmosphere. If you are planning a large soiree, the hotel can host up to 1,000 guests in its luxurious and spacious event center. For more intimate ceremonies, an outdoor deck provides breathtaking views of the city for you and 20 guests. A heated outdoor pool offers a charming area to socialize with guests late into the night as the city whirls around you. For dining options, the hotel boasts five American and Polynesian-inspired restaurants and tiki bars. The staff will work to design a catering menu and tropical cocktail list that draws from all of these cuisines and delights the taste buds. \n\nMargaritaville Resort Times Square’s all-inclusive wedding packages include everything from tables and chairs to the wedding cake and décor. The venue is also happy to work with you to customize a wedding experience that speaks to you. For overnight accommodations, you will find 234 guest rooms at your disposal, all outfitted to achieve maximum comfort for you and your guests. These rooms are equipped with rainfall showers, plush furniture, silky sheets, 55-inch Smart TVs, and more to pamper you on your momentous occasion. Come escape to Margaritaville, where the island vibes will pave the way for the most romantic day of your life.", "rating": null, "number": "(201) 951-4584", "location": "560 Seventh Ave, New York, NY", "photos": ["https://media-api.xogrp.com/images/9b50b345-b5f0-45a6-9996-27005231450e~sc_324.480"]},
{"title": "HK Hall", "description": "Welcome to HK Hall, a historic NYC venue with a new look in the heart of Hell's Kitchen. HK Hall is packed with modern amenities to make any event shine. A graceful and fully functional turn key space with robust production capabilities, striking decor and top tier catering. Contact us to start creating your occasion.\n\nFacilities and Capacity\nHK Hall offers a ballroom space suited for your ceremony, dinner and dancing. A mezzanine over looking the dance floor is perfect for cocktail hour. When it's time to dance the space comes alive with our nightclub sound, lighting and video capabilities.\n\nServices Offered\nThe starting site fee covers event space rental, event planning and all you need for meal service.\n\nCuisine\nCuisine at HK Hall is flavored by American New and Latin inspiration. Catering packages include cocktails with butlered hors d’oeuvres on our mezzanine. For dinner we offer entree and themed stations plus butlered desserts created by our in house pasty chef. Outside cake can be accomodated. Bar service includes premium open bar, with champagne toasts available.\n\nOther Services\n\nIn addition to wedding services, HK Hall can also host other special events and celebrations. These include bar/bat mitzvahs, conferences, corporate events, fashion shows, non-profit events, press events, product launches, and more.\n\nLocation\nHK Hall is located in the Hell's Kitchen area of Manhattan, a short walk from the Intrepid Sea, Air, and Space Museum and Circle Line Sightseeing Cruises, to name a few of the many local attractions in the heart of New York City.", "rating": null, "number": "(212) 957-1800", "location": "605 West 48th Street, New York, NY", "photos": ["https://media-api.xogrp.com/images/9604f424-628c-4ac6-b434-9a3186e37c4b~sc_324.480", "https://media-api.xogrp.com/images/4907b4bd-34dd-42a9-8ec5-5ef56a89f8ed~sc_324.480", "https://media-api.xogrp.com/images/cd17274b-0d15-431d-ab0f-c5a08cc637f7~sc_324.232", "https://media-api.xogrp.com/images/b9b560ac-e83a-4c55-b32e-c4c1740913a2~sc_324.232"]},
{"title": "SkyView Golf Club", "description": "Located in Sparta, NJ, SkyView Golf Club is a metropolitan venue that offers a truly unique wedding experience. Bolstering this, around the venue are scenic views, spanning across the New Jersey skyline. Comprising a professional staff, SkyView Golf Club is ready to help couples start their new chapter with a memorable celebration.\n\nSkyView Golf Club has a satisfyingly challenging course that weaves through striking natural terrain. A scenic wedding venue, this property features approximately 190 acres of lush land. Across it, various points of interest, like a rustic log cabin and a barn complete with silos, create a picturesque backdrop. A gem of Sussex County, SkyView Golf Club can provide the perfect destination for any wedding event.\n\nThe ceremony area at SkyView Golf Club includes a breathtaking panorama view of the Hamburg Mountains. Complete with a renovated cocktail hour terrace, the on-site event space offers floor-to-ceiling sliding glass doors. The Grand Ballroom features 15-foot ceilings, adorned with string lights that set the mood. Both weddings and banquets can be held here, surrounded by the elegant and rustic scenery that New Jersey has to offer. While here, couples and their guests can enjoy being pampered by full-service catering staff. Both semi-formal and formal dining packages are available, meaning that to-be-weds can select the option that suits them and their needs. During a celebration at SkyView Golf Club, memories can be made that last a lifetime. To ensure that couples and their guests are cared for from start to finish, the attentive in-house staff is happy to answer questions and queries about wedding planning and coordination.", "rating": "5", "number": "(973) 726-4653 ext. 2", "location": "226 Lafayette Road, Sparta, NJ", "photos": ["https://media-api.xogrp.com/images/52a048ef-3004-4cbc-a6ce-ca88c639009d~sc_324.480", "https://media-api.xogrp.com/images/f27e5e3a-e37c-4f21-b080-898979cdf02d~sc_324.480", "https://media-api.xogrp.com/images/724ca112-d004-4f74-90a4-e7eae1756ee6~sc_324.232", "https://media-api.xogrp.com/images/b4ef29f1-2f44-4d32-838a-33e2461daaa7~sc_324.232"]},
{"title": "The Wall Street Hotel", "description": "The Wall Street Hotel is an elegant wedding venue in the heart of New York City, NY. Embracing charm and culture, the hotel is a warm and vibrant oasis. The Wall Street Hotel is an eco-friendly venue committed to reducing its carbon footprint and creating a better world. \n\nThe Wall Street Hotel offers a range of spaces to host wedding receptions. The Gerdau Ballroom features floor-to-ceiling windows that flood the space with natural light by day and the glow of the city by night. Opening up to an outdoor patio on the hotel's top floor, guests can delight in stunning views of the East River. The space accommodates 250 guests and can be split into segments or rented as a whole. Their unique rooftop bar and lounge can host small receptions of up to 75 guests. Ebonized wood, greenery, and sunset views create a charming atmosphere here. Their smaller, uniquely decorated rooms offer seating for intimate dinners, accommodating up to 12.\n\nAt The Wall Street Hotel, couples can choose various curated wedding packages. The hotel provides staff, tables, banquet chairs, linen, china, glassware, and flatware. On-site catering options include reception displays, stations, plated dinners, and late-night bites. Couples can choose from the hotel's menus or have a custom one created for their wedding. They also provide a bar service with premium spirits, signature cocktails, champagne toast, and a range of beer and wine. On your wedding day, a banquet and events manager will assist with food service and other needs to ensure a smooth and unforgettable experience.", "rating": null, "number": "(212) 837-1926 ext. 8026", "location": "88 Wall Street, New York, NY | New York", "photos": ["https://media-api.xogrp.com/images/bb0029e2-0a95-4cc0-899b-3a9a9fa1a454~sc_324.480", "https://media-api.xogrp.com/images/599a6750-b54f-4f60-bd8f-b9859c2d9638~sc_324.480", "https://media-api.xogrp.com/images/307bd1a7-475f-4131-8c8c-d8684dd2cf56~sc_324.232"]}
]